"use strict";

window.Names = (function () {
  let chains = [];

  // calculate Markov chain for a namesbase
  const calculateChain = function (string) {
    const chain = [];
    const array = string.split(",");

    for (const n of array) {
      let name = n.trim().toLowerCase();
      const basic = !/[^\u0000-\u007f]/.test(name); // basic chars and English rules can be applied

      // split word into pseudo-syllables
      for (let i = -1, syllable = ""; i < name.length; i += syllable.length || 1, syllable = "") {
        let prev = name[i] || ""; // pre-onset letter
        let v = 0; // 0 if no vowels in syllable

        for (let c = i + 1; name[c] && syllable.length < 5; c++) {
          const that = name[c],
            next = name[c + 1]; // next char
          syllable += that;
          if (syllable === " " || syllable === "-") break; // syllable starts with space or hyphen
          if (!next || next === " " || next === "-") break; // no need to check

          if (vowel(that)) v = 1; // check if letter is vowel

          // do not split some diphthongs
          if (that === "y" && next === "e") continue; // 'ye'
          if (basic) {
            // English-like
            if (that === "o" && next === "o") continue; // 'oo'
            if (that === "e" && next === "e") continue; // 'ee'
            if (that === "a" && next === "e") continue; // 'ae'
            if (that === "c" && next === "h") continue; // 'ch'
          }

          if (vowel(that) === next) break; // two same vowels in a row
          if (v && vowel(name[c + 2])) break; // syllable has vowel and additional vowel is expected soon
        }

        if (chain[prev] === undefined) chain[prev] = [];
        chain[prev].push(syllable);
      }
    }

    return chain;
  };

  const updateChain = i => {
    chains[i] = nameBases[i]?.b ? calculateChain(nameBases[i].b) : null;
  };

  const clearChains = () => {
    chains = [];
  };

  // generate name using Markov's chain
  const getBase = function (base, min, max, dupl) {
    if (base === undefined) return ERROR && console.error("Please define a base");

    if (nameBases[base] === undefined) {
      if (nameBases[0]) {
        WARN && console.warn("Namebase " + base + " is not found. First available namebase will be used");
        base = 0;
      } else {
        ERROR && console.error("Namebase " + base + " is not found");
        return "ERROR";
      }
    }

    if (!chains[base]) updateChain(base);

    const data = chains[base];
    if (!data || data[""] === undefined) {
      tip("Namesbase " + base + " is incorrect. Please check in namesbase editor", false, "error");
      ERROR && console.error("Namebase " + base + " is incorrect!");
      return "ERROR";
    }

    if (!min) min = nameBases[base].min;
    if (!max) max = nameBases[base].max;
    if (dupl !== "") dupl = nameBases[base].d;

    let v = data[""],
      cur = ra(v),
      w = "";
    for (let i = 0; i < 20; i++) {
      if (cur === "") {
        // end of word
        if (w.length < min) {
          cur = "";
          w = "";
          v = data[""];
        } else break;
      } else {
        if (w.length + cur.length > max) {
          // word too long
          if (w.length < min) w += cur;
          break;
        } else v = data[last(cur)] || data[""];
      }

      w += cur;
      cur = ra(v);
    }

    // parse word to get a final name
    const l = last(w); // last letter
    if (l === "'" || l === " " || l === "-") w = w.slice(0, -1); // not allow some characters at the end

    let name = [...w].reduce(function (r, c, i, d) {
      if (c === d[i + 1] && !dupl.includes(c)) return r; // duplication is not allowed
      if (!r.length) return c.toUpperCase();
      if (r.slice(-1) === "-" && c === " ") return r; // remove space after hyphen
      if (r.slice(-1) === " ") return r + c.toUpperCase(); // capitalize letter after space
      if (r.slice(-1) === "-") return r + c.toUpperCase(); // capitalize letter after hyphen
      if (c === "a" && d[i + 1] === "e") return r; // "ae" => "e"
      if (i + 2 < d.length && c === d[i + 1] && c === d[i + 2]) return r; // remove three same letters in a row
      return r + c;
    }, "");

    // join the word if any part has only 1 letter
    if (name.split(" ").some(part => part.length < 2))
      name = name
        .split(" ")
        .map((p, i) => (i ? p.toLowerCase() : p))
        .join("");

    if (name.length < 2) {
      ERROR && console.error("Name is too short! Random name will be selected");
      name = ra(nameBases[base].b.split(","));
    }

    return name;
  };

  // generate name for culture
  const getCulture = function (culture, min, max, dupl) {
    if (culture === undefined) return ERROR && console.error("Please define a culture");
    const base = pack.cultures[culture].base;
    return getBase(base, min, max, dupl);
  };

  // generate short name for culture
  const getCultureShort = function (culture) {
    if (culture === undefined) return ERROR && console.error("Please define a culture");
    return getBaseShort(pack.cultures[culture].base);
  };

  // generate short name for base
  const getBaseShort = function (base) {
    const min = nameBases[base] ? nameBases[base].min - 1 : null;
    const max = min ? Math.max(nameBases[base].max - 2, min) : null;
    return getBase(base, min, max, "", 0);
  };

  // generate state name based on capital or random name and culture-specific suffix
  const getState = function (name, culture, base) {
    if (name === undefined) return ERROR && console.error("Please define a base name");
    if (culture === undefined && base === undefined) return ERROR && console.error("Please define a culture");
    if (base === undefined) base = pack.cultures[culture].base;

    return name;
    //TODO: Modified !

    // exclude endings inappropriate for states name
    // if (name.includes(" ")) name = capitalize(name.replace(/ /g, "").toLowerCase()); // don't allow multiword state names
    // if (name.length > 6 && name.slice(-4) === "berg") name = name.slice(0, -4); // remove -berg for any
    // if (name.length > 5 && name.slice(-3) === "ton") name = name.slice(0, -3); // remove -ton for any
    //
    // if (base === 5 && ["sk", "ev", "ov"].includes(name.slice(-2))) name = name.slice(0, -2);
    // // remove -sk/-ev/-ov for Ruthenian
    // else if (base === 12) return vowel(name.slice(-1)) ? name : name + "u";
    // // Japanese ends on any vowel or -u
    // else if (base === 18 && P(0.4))
    //   name = vowel(name.slice(0, 1).toLowerCase()) ? "Al" + name.toLowerCase() : "Al " + name; // Arabic starts with -Al
    //
    // // no suffix for fantasy bases
    // if (base > 32 && base < 42) return name;

    // define if suffix should be used


    // if (name.length > 3 && vowel(name.slice(-1))) {
    //   if (vowel(name.slice(-2, -1)) && P(0.85)) name = name.slice(0, -2);
    //   // 85% for vv
    //   else if (P(0.7)) name = name.slice(0, -1);
    //   // ~60% for cv
    //   else return name;
    // } else if (P(0.4)) return name; // 60% for cc and vc
    //
    // // define suffix
    // let suffix = "ia"; // standard suffix
    //
    // const rnd = Math.random(),
    //   l = name.length;
    // if (base === 3 && rnd < 0.03 && l < 7) suffix = "terra";
    // // Italian
    // else if (base === 4 && rnd < 0.03 && l < 7) suffix = "terra";
    // // Spanish
    // else if (base === 13 && rnd < 0.03 && l < 7) suffix = "terra";
    // // Portuguese
    // else if (base === 2 && rnd < 0.03 && l < 7) suffix = "terre";
    // // French
    // else if (base === 0 && rnd < 0.5 && l < 7) suffix = "land";
    // // German
    // else if (base === 1 && rnd < 0.4 && l < 7) suffix = "land";
    // // English
    // else if (base === 6 && rnd < 0.3 && l < 7) suffix = "land";
    // // Nordic
    // else if (base === 32 && rnd < 0.1 && l < 7) suffix = "land";
    // // generic Human
    // else if (base === 7 && rnd < 0.1) suffix = "eia";
    // // Greek
    // else if (base === 9 && rnd < 0.35) suffix = "maa";
    // // Finnic
    // else if (base === 15 && rnd < 0.4 && l < 6) suffix = "orszag";
    // // Hungarian
    // else if (base === 16) suffix = rnd < 0.6 ? "yurt" : "eli";
    // // Turkish
    // else if (base === 10) suffix = "guk";
    // // Korean
    // else if (base === 11) suffix = " Guo";
    // // Chinese
    // else if (base === 14) suffix = rnd < 0.5 && l < 6 ? "tlan" : "co";
    // // Nahuatl
    // else if (base === 17 && rnd < 0.8) suffix = "a";
    // // Berber
    // else if (base === 18 && rnd < 0.8) suffix = "a"; // Arabic
    //
    // return validateSuffix(name, suffix);
  };

  function validateSuffix(name, suffix) {
    if (name.slice(-1 * suffix.length) === suffix) return name; // no suffix if name already ends with it
    const s1 = suffix.charAt(0);
    if (name.slice(-1) === s1) name = name.slice(0, -1); // remove name last letter if it's a suffix first letter
    if (vowel(s1) === vowel(name.slice(-1)) && vowel(s1) === vowel(name.slice(-2, -1))) name = name.slice(0, -1); // remove name last char if 2 last chars are the same type as suffix's 1st
    if (name.slice(-1) === s1) name = name.slice(0, -1); // remove name last letter if it's a suffix first letter
    return name + suffix;
  }

  // generato name for the map
  const getMapName = function (force) {
    if (!force && locked("mapName")) return;
    if (force && locked("mapName")) unlock("mapName");
    const base = P(0.7) ? 2 : P(0.5) ? rand(0, 6) : rand(0, 31);
    if (!nameBases[base]) {
      tip("Namebase is not found", false, "error");
      return "";
    }
    const min = nameBases[base].min - 1;
    const max = Math.max(nameBases[base].max - 3, min);
    const baseName = getBase(base, min, max, "", 0);
    const name = P(0.7) ? addSuffix(baseName) : baseName;
    mapName.value = name;
  };

  function addSuffix(name) {
    // const suffix = P(0.8) ? "ia" : "land";
    // if (suffix === "ia" && name.length > 6) name = name.slice(0, -(name.length - 3));
    // else if (suffix === "land" && name.length > 6) name = name.slice(0, -(name.length - 5));
    // TODO: Modified !
    const suffix = "";
    return validateSuffix(name, suffix);
  }

  const getNameBases = function () {
    // name, min length, max length, letters to allow duplication, multi-word name rate [deprecated]
    // prettier-ignore
    return [
      // real-world bases by Azgaar:
      {name: "德意志 German", i: 0, min: 2, max: 12, d: "lt", m: 0,
        b: "阿赫恩,艾希哈尔登,艾特恩,阿尔布布吕克,阿尔皮尔斯巴赫,阿尔滕施泰格,阿尔特亨格施泰特,阿彭魏尔,奥根,巴登,巴登魏勒,拜尔斯布龙,巴尔雷希滕,贝林根,贝格豪普滕,伯瑙,比伯拉赫,比德巴赫,宾岑,比尔肯多夫,比尔肯费尔德,比施魏尔,布伦贝格,博伦,博尔施魏尔,邦多夫,伯辛根,布劳恩林根,布赖萨赫,布赖斯高,布赖特瑙,布里加赫塔尔,布亨巴赫,布金根,比尔,比勒塔尔,考尔,达克斯贝格,多贝尔,多瑙艾兴根,多恩汉,多恩施泰滕,多廷根,敦宁根,杜尔巴赫,迪尔海姆,埃布豪森,埃布林根,埃弗林根,埃根豪森,埃伦基兴,埃尔斯贝格,埃梅尔丁根,艾森巴赫,埃尔察赫,埃尔茨塔尔,埃门丁根,恩丁根,恩格尔斯布兰德,恩茨,恩茨克洛斯特尔勒,埃施布伦,埃滕海姆,埃特林根,费尔德贝格,菲舍尔巴赫,菲辛根,弗卢恩,福尔巴赫,弗赖阿姆特,弗赖堡,弗罗伊登施塔特,弗里登魏勒,弗里森海姆,弗罗恩德,富特旺根,加格瑙,盖辛根,根根巴赫,格恩斯巴赫,格拉特,格拉滕,格洛特塔尔,戈尔维尔,戈滕海姆,格拉芬豪森,格伦察赫,格里斯巴赫,古塔赫,古滕巴赫,哈格,海特巴赫,哈特,哈默斯巴赫,哈塞尔,哈斯拉赫,豪萨赫,豪森,豪瑟恩,海特斯海姆,赫博尔茨海姆,赫伦阿尔布,赫里施里德,欣特扎滕,霍恩施万德,霍芬,霍夫施泰滕,霍赫贝格,霍尔布,霍尔本,霍恩贝格,许芬根,伊巴赫,伊林根,因茨林根,坎登,卡佩尔,卡佩尔罗德克,卡尔斯巴德,卡尔斯鲁厄,凯尔,凯尔滕,基彭海姆,基希察滕,克尼格斯费尔德,克罗青根,库彭海姆,库萨贝格,拉尔,劳赫林根,劳夫,劳芬堡,劳滕巴赫,劳特巴赫,伦茨基希,利本策尔,洛芬瑙,洛芬根,勒拉赫,洛斯堡,马尔贝格,马尔斯堡,马尔施,马尔希,马克塞尔,马尔策尔,毛尔堡,门希魏勒,米伦巴赫,米尔海姆,明斯特塔尔,穆尔格,纳戈尔德,诺伊布拉赫,诺伊恩堡,诺伊豪森,诺伊里德,诺伊魏勒,尼德埃沙赫,诺德拉赫,奥伯哈默斯巴赫,奥伯基希,奥伯恩多夫,奥伯巴赫,奥伯里德,奥伯沃尔法赫,奥芬堡,奥尔斯巴赫,奥彭瑙,奥尔滕贝格,厄蒂希海姆,奥滕霍芬,奥特斯魏尔,彼得斯塔尔,法芬魏勒,普法尔茨格拉芬魏勒,普福尔茨海姆,拉施塔特,伦兴,莱茵瑙,莱茵费尔登,莱茵明斯特,里肯巴赫,里波尔茨瑙,罗尔多夫,罗特魏尔,鲁明根,鲁斯特,萨克根,萨斯巴赫,萨斯巴赫瓦尔登,沙尔巴赫,沙尔施塔特,沙普巴赫,申肯策尔,希尔塔赫,施利恩根,施卢赫湖,肖姆贝格,舍瑙,舍嫩贝格,舍恩瓦尔德,舍普海姆,舍普洛赫,施拉姆贝格,舒特塔尔,施文宁根,施沃施塔特,塞巴赫,塞尔巴赫,塞瓦尔德,塞克瑙,西默斯费尔德,西蒙斯瓦尔德,辛茨海姆,索尔登,施陶芬,施泰根,施泰纳赫,施泰嫩,施泰因毛恩,施特劳本哈特,施图林根,苏尔茨,苏尔茨堡,泰纳赫,蒂芬布龙,廷根,蒂蒂湖,托特莫斯,托特瑙,托特瑙贝格,特里贝格,图瑙,图宁根,于林根,翁特基尔纳赫,赖兴巴赫,乌岑费尔德,菲林根,菲林根多夫,福茨堡,福伦巴赫,瓦尔达赫塔尔,瓦尔德布龙,瓦尔德基希,瓦尔德胡特,韦尔,韦尔海姆,魏森巴赫,文巴赫,维登,维森塔尔,维尔德巴德,维尔德贝格,温策尔恩,维特林根,维特瑙,沃尔法赫,武塔赫,武特申根,维伦,扎韦尔施泰因"},

      {name: "英格兰 English", i: 1, min: 2, max: 11, d: "", m: .1,
        b: "阿宾登,奥尔布赖顿,奥尔斯特,阿尔蒙德伯里,奥尔特灵厄姆,阿默舍姆,安多弗,阿普尔比,阿什伯恩,阿瑟斯通,阿维顿,阿克斯布里奇,艾尔斯伯里,鲍尔多克,班堡,巴顿,贝辛斯托克,贝尔登,贝尔,伯克利,贝里克,贝特利,比迪福德,宾格利,伯明翰,布兰福德,布莱钦利,博德明,博尔顿,布瑟姆,伯勒布里奇,博斯卡斯尔,博辛尼,布兰伯,布兰普顿,布雷斯特德,布雷特福德,布里奇敦,布里德灵顿,布罗姆亚德,布鲁顿,白金汉,邦盖,伯顿,卡恩,剑桥,坎特伯雷,卡莱尔,卡斯尔顿,科斯,查默斯,乔利,奇切斯特,奇林顿,奇诺,奇平,奇斯伯里,克利奥伯里,克利福德,克利夫顿,克利瑟罗,科克茅斯,科尔斯希尔,库姆,康格尔顿,克拉夫霍尔,克雷迪顿,卡登贝克,道尔顿,达林顿,多德布鲁克,德拉克斯,达德利,邓斯特布尔,邓斯特,邓威奇,达勒姆,戴莫克,埃克塞特,埃克斯宁,法林顿,费尔顿,芬尼,法恩登,弗洛克伯勒,福伊,弗兰普顿,盖茨黑德,加顿,戈德曼彻斯特,格兰庞德,格兰瑟姆,吉尔福德,黑尔索文,哈尔顿,哈博特尔,哈洛,哈特菲尔德,哈瑟利,海登,赫尔斯顿,亨利,赫特福德,海茨伯里,欣克利,希钦,霍尔姆,霍恩比,霍舍姆,肯德尔,基尼尔沃思,基尔克汉普顿,基内顿,金顿,金弗,柯比,纳尔斯伯勒,纳茨福德,朗塞斯顿,莱顿,刘易斯,林顿,洛斯,卢顿,莱姆,林普斯通,麦克尔斯菲尔德,梅德利,马尔伯勒,马尔登,曼彻斯特,曼宁特里,马拉齐恩,马尔伯勒,马什菲尔德,米尔,梅里菲尔德,米德尔威奇,米德赫斯特,米尔本,米特福德,莫德伯里,蒙塔丘特,莫斯霍尔,纽比金,纽伯勒,纽伯里,纽恩登,纽恩特,诺勒姆,北利奇,诺斯,奥克姆,奥尔尼,奥尔福德,奥姆斯科克,奥斯沃斯特里,帕德斯托,佩恩顿,彭克内斯,彭里斯,彭赞斯,珀肖尔,彼得斯菲尔德,皮文西,皮克林,皮尔顿,庞特弗拉特,朴茨茅斯,普雷斯顿,夸特福德,雷丁,雷德克利夫,雷特福德,罗金厄姆,罗姆尼,罗斯伯里,罗斯韦尔,索尔兹伯里,萨尔塔什,锡福德,锡索尔特,谢尔斯顿,希夫纳尔,肖勒姆,锡德茅斯,斯基普西,斯基普顿,索利哈尔,萨默顿,索瑟姆,绍森德,斯坦登,斯坦斯特德,斯泰普尔顿,斯托特斯登,萨德伯里,斯沃西,塔默顿,塔波利,泰特伯里,撒切姆,萨克斯特,塞特福德,索恩伯里,廷塔杰尔,蒂弗顿,托克西,托特尼斯,托斯特,特雷戈尼,特雷马顿,图特伯里,阿克斯布里奇,沃林福德,沃勒姆,沃伦茅斯,沃格雷夫,沃顿,沃切特,沃特福德,温多弗,西伯里,西切普,韦茅斯,惠特福德,威克沃,维冈,维格莫尔,温切尔西,温克利,威斯科姆,威瑟姆,威瑟里奇,维维利斯科姆,伍德伯里,约维尔"},

      {name: "法兰西 French", i: 2, min: 2, max: 13, d: "nlrs", m: .1,
        b: "阿东,艾扬,阿米利,安东维尔,阿尔东,阿尔特奈,阿谢勒,阿斯库,阿特雷,奥班,奥德维尔,奥奈,奥特吕,奥维利耶,奥西,阿韦龙,巴孔,巴尔东,巴尔维尔,巴蒂利,博勒,巴佐什,博尚,博让斯,博利厄,博讷,贝勒加德,博埃斯,博伊尼,布瓦孔蒙,布瓦莫朗,布瓦索,邦达罗伊,邦内,邦尼,博尔德,布,布吉,布依利,布莱,布宗维尔,布齐,博恩,布雷,布雷托,布里亚尔,布里亚尔,布里西,布罗梅耶,布西,塞波伊,瑟尔科特,瑟尔东,瑟尔诺伊,塞萨维尔,谢伊利,谢安吉,沙莱特,尚邦,尚普莱,尚托,尚特科克,沙佩尔,沙尔姆,沙尔蒙,沙尔松维尔,夏托,夏托讷夫,沙特尔,沙特诺伊,沙蒂永,绍西,舍西,舍万,舍维隆,舍维利,舍弗里,希吕耶,舒,修勒,克勒里,柯昂斯,科利尼,孔布勒,孔布勒,孔弗朗,科贝耶,科基耶罗,科尔特拉,库德罗伊,库隆,库米耶,库尔塞尔,库尔西,库尔特莫,库尔坦皮埃尔,库尔特奈,克拉万,克罗特,达东维尔,达马里,当皮埃尔,达沃伊,德蒙,迪曼什维尔,多内里,多迪夫,多赛恩维尔,杜希,德里,埃希勒尤斯,埃格里,昂热维尔,埃皮埃,埃尔斯维尔,埃尔沃维尔,埃斯克雷讷,埃斯克里涅勒,埃斯图伊,法韦雷勒,费,费恩斯,费罗勒,费里埃尔,弗勒里,丰特内,福雷,福谢罗勒,弗雷维尔,加蒂奈,高伯坦,杰米尼,热尔米尼,吉迪,吉昂,吉罗勒,吉弗莱纳,贡德维尔,格朗热蒙,格勒讷维尔,格里塞勒,吉尼维尔,吉利,吉勒索内,于特尔,于索,英格朗,英格尔,昂特维尔,伊斯德,伊夫尔,雅热戈,朱伊,朱兰维尔,布西埃尔,拉阿斯,拉东,莱伊利,朗格塞,勒乌维尔,利尼,隆布勒伊,洛尔西,洛里,卢里,卢祖埃,马勒舍尔布瓦,马尔西利,马迪,马罗,马里尼,马尔萨万维耶,梅勒罗伊,梅讷斯特罗,梅兰维尔,梅萨,默昂,梅济耶,米涅勒,米涅雷特,米拉博,蒙塔尔吉斯,蒙巴罗瓦,蒙布伊,蒙克雷松,蒙特罗,蒙蒂尼,蒙利亚尔,莫尔芒,莫维尔,穆利内,穆隆,南克雷,纳尔吉斯,内斯普卢伊,纽维尔,纽维,内沃伊,尼贝勒,诺让,诺耶尔,奥克雷,奥伊松,奥利韦,昂德维尔,昂泽兰,奥尔良,奥尔姆,奥维尔,乌索伊,乌塔维尔,乌祖埃,潘内谢尔,潘纳,帕泰,波库尔,珀尔,皮埃尔菲特,皮蒂韦雷,皮蒂维耶,波伊伊,波蒂耶,普朗特奈,普雷斯诺伊,普雷西尼,皮索,基耶尔,拉穆卢,勒布雷谢恩,鲁弗雷,罗齐埃尔,罗佐伊,鲁昂,桑迪隆,桑托,萨然,塞奥,塞什布里埃尔,塞莫伊,塞内利,塞尔梅兹,西格卢瓦,索特尔,苏吉,苏利,苏里,塔韦尔,蒂尼翁维尔,蒂莫里,托莱,图,蒂吉,蒂韦尔农,图尔努瓦西,特雷努,特雷伊,特里格尔,特里奈,瓦讷,瓦朗纳,维讷西,维耶勒,维埃纳,维格兰,维尼,维拉姆布兰,维勒曼多尔,维勒穆捷,维勒穆尔兰,维勒纽夫,维勒罗,维勒沃克,维勒索,维莫里,维特里,弗里尼"},

      {name: "意大利 Italian", i: 3, min: 2, max: 12, d: "cltr", m: .1,
        b: "阿库莫利,阿夸丰达塔,阿夸潘登特,阿库托,阿菲莱,阿戈斯塔,阿拉特里,阿尔巴诺,阿卢米耶雷,阿尔维托,阿马塞诺,阿马特里切,阿纳涅,安圭拉拉,安蒂科利,安特罗多科,安齐奥,阿普里利亚,阿奎诺,阿尔奇纳佐,阿里奇亚,阿尔皮诺,阿尔索利,奥索尼亚,巴尼奥雷焦,巴西亚诺,贝莱格拉,贝尔蒙特,博尔塞纳,博马佐,博尔戈罗塞,博维莱,布拉奇亚诺,布罗科斯特拉,卡尔卡塔,卡梅拉塔,坎帕尼亚诺,坎波利,卡纳莱,卡尼诺,坎塔利切,坎塔卢波,卡普拉尼卡,卡普拉罗拉,卡博尼亚诺,卡萨拉特蒂科,卡萨尔维耶里,卡斯特尔福尔特,卡斯特尔努沃,卡斯蒂廖内,卡斯特罗,卡斯特罗奇耶洛,切卡诺,切莱诺,切莱雷,切雷托,切尔瓦拉,切尔韦特里,恰姆皮诺,奇奇利亚诺,奇塔杜卡莱,奇塔雷阿莱,奇维塔,奇维泰拉,科尔费利切,科勒费罗,科勒帕多,科隆纳,孔切尔维亚诺,孔菲尼,孔蒂利亚诺,科里,科塔内洛,埃斯佩里亚,法莱里亚,法尔内塞,费伦蒂诺,菲亚米尼亚诺,菲拉奇亚诺,菲乌吉,菲乌米奇诺,丰迪,丰塔纳,丰特,丰特基亚里,福尔米亚,弗拉斯卡蒂,弗拉索,弗罗西诺内,福莫内,盖塔,加莱塞,加维尼亚诺,杰纳扎诺,朱利亚诺,戈尔加,格拉多利,格罗塔费拉塔,格罗特,瓜尔奇诺,圭多尼亚,伊斯基亚,伊索拉,拉比科,拉布罗,拉迪斯波利,拉泰拉,莱诺拉,莱昂内萨,利琴扎,隆戈内,卢布里亚诺,马恩扎,马廖阿诺,马拉诺,马尔切利纳,马切特利,马里诺,马扎诺,门塔纳,米奇利亚诺,明图尔诺,蒙塔尔托,蒙塔索拉,蒙特布奥诺,蒙特弗拉维奥,蒙特拉尼科,蒙特莱奥内,蒙特内罗,蒙特罗西,莫里科内,莫卢波,纳扎诺,内米,内罗拉,内斯波罗,内图诺,诺尔玛,奥莱瓦诺,奥纳诺,奥里奥洛,奥尔泰,奥尔维尼奥,帕加尼科,帕利亚诺,帕隆巴拉,帕特里卡,佩斯科罗基亚诺,佩特雷拉,皮安萨诺,皮奇尼斯科,皮科,皮耶迪蒙特,皮廖,皮尼亚塔罗,波焦,波利,波梅齐亚,庞特科尔沃,庞蒂尼亚,庞扎诺,波斯塔,波扎利亚,普里韦尔诺,普罗切诺,里尼亚诺,里奥弗雷多,里皮,里沃杜特里,罗卡,罗卡戈尔加,罗坎蒂卡,罗卡塞卡,罗伊阿特,隆奇廖内,罗维亚诺,萨利萨诺,桑布奇,桑塔,桑蒂尼,斯坎德里格利亚,塞尼,塞尔奇,塞尔莫内塔,塞罗内,塞特弗拉蒂,塞兹,斯古尔戈拉,索尼诺,索拉,索里亚诺,斯佩隆加,斯皮尼奥,苏比亚科,苏皮诺,苏特里,塔拉诺,塔尔奎尼亚,特雷莱,特拉奇纳,提沃利,托菲亚,托尔法,托里切,托里切拉,特雷维,特雷维尼亚诺,特里维廖内,图拉尼亚,图斯卡尼亚,瓦伦塔诺,瓦莱科尔萨,瓦莱迈奥,瓦莱皮埃特拉,瓦莱拉诺,瓦萨内洛,维贾诺,维莱特里,文托泰内,韦罗利,韦特拉拉,维卡尔维,维科,维科瓦罗,维尼亚内洛,维泰尔博,维蒂库索,维托基亚诺,维瓦罗,扎加罗洛"},

      {name: "卡斯蒂利亚 Castillian", i: 4, min: 2, max: 11, d: "lr", m: 0,
        b: "阿霍夫林,阿拉梅达,阿拉米诺斯,阿尔瓦雷斯,阿尔巴雷亚尔,阿尔本迪戈,阿尔卡尼索,阿尔考德特,阿尔科莱亚,阿尔德亚,阿尔德亚努埃瓦,阿尔加尔,阿尔戈拉,阿尔翁迪加,阿尔马德罗内斯,阿尔门德拉尔,阿洛韦拉,安吉塔,阿尔班孔,阿尔赫西利亚,阿尔赫斯,阿罗约,阿坦松,阿蒂恩萨,阿苏凯卡,拜德斯,巴尼奥斯,巴尔加斯,巴里奥佩德罗,贝尔维斯,贝尔宁切斯,布里韦加,布埃纳文图拉,布尔戈斯,布尔吉略斯,布斯塔雷斯,卡瓦尼利亚斯,卡尔萨达,卡马雷纳,坎皮略,坎塔洛哈斯,卡尔迪埃尔,卡梅纳,卡萨斯,卡斯特洪,卡斯特利亚尔,卡斯蒂尔福特,卡斯蒂略,卡斯蒂尔努埃沃,卡萨莱加斯,森特内拉,塞尔韦拉,切卡,乔萨斯,丘埃卡,西富恩特斯,辛科维利亚斯,西鲁埃拉斯,科戈洛尔,科戈鲁多,孔苏埃格拉,科佩尔纳尔,科拉尔,库埃尔瓦,多明戈,多斯巴里奥斯,德里耶韦斯,杜龙,埃斯卡洛纳,埃斯卡洛尼利亚,埃斯卡米利亚,埃斯科佩特,埃斯皮诺萨,埃斯普莱加雷斯,埃斯基维亚斯,埃斯塔布莱斯,埃斯特列加纳,丰塔纳尔,富恩贝利达,富恩萨利达,富恩特尔萨斯,加哈内霍斯,加尔维斯,加斯库埃尼亚,赫林多特,瓜达穆尔,埃拉斯,埃雷里亚,埃雷鲁埃拉,伊诺霍萨,伊塔,翁布拉多斯,翁塔纳尔,奥尔米戈斯,韦卡斯,韦尔塔,乌马内斯,伊利亚纳,伊列斯卡斯,伊涅斯托拉,伊鲁埃斯特,哈德拉克,希鲁埃克,拉加尔特拉,莱丹卡,利略,洛明查尔,洛兰卡,卢西略斯,卢萨加,卢宗,马德里,马甘,马拉加,马尔皮卡,曼萨纳尔,马奎达,马塞戈索,马蒂利亚斯,梅德兰达,梅吉纳,梅霍拉达,米利亚纳,米尔马科斯,米拉布埃诺,米拉尔里奥,莫塞洪,莫查莱斯,莫利纳,蒙德哈尔,蒙塔龙,莫拉,莫拉蒂利亚,莫雷尼利亚,纳瓦斯,内格雷多,诺布莱哈斯,努曼西亚,努诺,奥卡尼亚,奥森特霍,奥利亚斯,奥尔梅达,翁蒂戈拉,奥雷亚,奥尔加斯,奥罗佩萨,奥特罗,帕尔马,帕尔多斯,帕雷德斯,佩尼亚尔韦尔,佩皮诺,佩拉莱霍斯,皮尼利亚,皮奥斯,皮克拉斯,波蒂略,波韦达,波佐,普拉德纳,普拉多斯,普埃布拉,普埃尔托,克埃罗,金塔纳尔,雷沃洛萨,雷塔莫索,里瓦,里奥夫里奥,罗夫莱多,罗马尼略斯,罗马农内斯,鲁埃达,萨尔梅隆,圣蒂乌斯特,圣托,索乌卡,塞古拉,塞拉斯,塞米利亚斯,塞塞尼亚,塞蒂莱斯,塞维利亚,西贡萨,索拉尼略斯,索莫利诺斯,松塞卡,索蒂略,塔拉韦拉,塔拉维利亚,坦布莱克,滕迪利亚,蒂埃索,托拉尔瓦,托雷,托雷洪,托里霍斯,托尔托拉,托尔图埃拉,托塔内斯,特里略,乌塞达,乌赫纳,乌尔达,乌坦德,巴尔德索托斯,巴尔埃尔莫索,巴尔塔布拉多,巴尔韦尔德,贝拉达,比亚纳,耶布拉,云科斯,云克拉,萨奥雷哈斯,萨尔苏埃拉,索里塔"},

      {name: "鲁塞尼亚 Ruthenian", i: 5, min: 2, max: 10, d: "", m: 0,
        b: "别尔哥罗德,别洛别热耶,别雷,贝尔兹,别列斯季,别列热茨,别列佐韦茨,别列祖茨克,博布鲁伊斯克,博洛涅茨,鲍里索夫,博罗夫斯克,博热斯克,布拉茨拉夫,布良斯克,布林斯克,布林,比霍夫,切切尔斯克,切梅索夫,切列莫什,切尔连,切尔恩,切尔尼戈夫,切尔尼察,切尔诺贝利,切尔诺戈罗德,切尔托里耶斯克,切特韦尔特尼亚,杰米扬斯克,杰列韦斯克,杰维亚戈列斯克,季钦,季米特罗夫,多罗戈布奇,多罗戈布日,德列斯特温,德罗科夫,德鲁茨克,杜别钦,杜比奇,杜布基,杜布科夫,德韦连,加利奇,格列博沃,格林斯克,戈洛特,戈米伊,戈罗杰茨,戈罗季谢,戈罗德诺,戈罗霍韦茨,戈罗申,戈尔瓦尔,戈雷雄,霍尔姆,霍罗博尔,霍滕,霍廷,霍特梅日斯克,伊洛韦奇,伊万,伊兹博尔斯克,伊热斯拉夫尔,卡缅涅茨,卡涅夫,卡拉切夫,卡尔纳,卡瓦尔纳,克列切斯克,克利亚佩奇,科洛梅亚,科雷万,科皮尔,科列茨,科尔尼克,科罗楚诺夫,科尔舍夫,科尔孙,科什金,科捷利诺,科维拉,科热利斯克,科热利斯克,克列梅涅茨,克里切夫,克雷拉茨克,克斯尼亚京,库拉茨克,库尔斯克,库尔斯克,列别捷夫,利达,洛戈斯科,洛米霍沃斯特,洛谢什克,洛希奇,卢别奇,卢布诺,卢布茨克,卢茨克,卢钦,卢基,卢科姆利,卢扎,利沃夫,姆岑斯克,姆丁,梅德尼基,梅列哈,梅雷奇,梅列茨克,梅谢尔斯科耶,梅什科夫斯克,梅特利茨克,梅热茨克,姆格林,米哈伊洛夫,米基廷,米库利诺,米洛斯拉维奇,莫吉廖夫,莫洛加,莫列瓦,莫萨尔斯克,莫希尼,莫济里,姆斯季斯拉夫,姆斯季斯拉韦茨,穆拉文,涅梅奇,涅米扎,涅林斯克,尼昌,诺夫哥罗德,诺沃戈罗多克,奥博利奇,奥博连斯克,奥博连斯克,奥列什斯克,奥尔戈夫,奥梅尔尼克,奥波卡,奥波基,奥列舍克,奥尔列茨,奥谢琴,奥斯特尔,奥斯特罗格,奥斯特罗夫,佩列莱,佩列米尔,佩列梅什利,佩列罗夫,佩列谢琴,佩列维茨克,佩列亚斯拉夫,平斯克,普列斯,波洛茨克,普龙斯克,普罗波舍斯克,普尼亚,普季夫利,列奇察,罗德诺,罗加切夫,罗曼诺夫,罗姆内,罗斯拉夫尔,罗斯季斯拉夫尔,罗斯托韦茨,尔沙,鲁扎,雷布切斯克,雷尔斯克,日亚韦斯克,热韦,日希谢夫,桑博尔,谢连斯克,谢连斯克,谢尔佩伊斯克,希洛夫,舒亚,西涅奇,西日卡,斯卡拉,斯洛文斯克,斯卢茨克,斯梅金,斯涅波罗德,斯尼廷,斯诺夫斯克,索切沃,索科列茨,斯塔里察,斯塔罗杜布,斯捷潘,斯捷尔日,斯特列申,苏捷斯克,斯维涅茨克,斯维斯洛奇,捷列博夫利,捷尔诺夫,捷希洛夫,捷捷林,季韦尔斯克,托尔切夫斯克,托罗佩茨,托尔若克,特里波利耶,特鲁布切夫斯克,图尔,图罗夫,乌斯维亚特,乌捷什科夫,瓦西里科夫,韦利利,韦利耶,韦涅夫,韦尼恰,韦尔杰列夫,韦列亚,韦韦列斯克,维亚兹马,维德别斯克,维季切夫,沃伊诺,沃洛季梅尔,沃洛克,沃伦,沃罗别斯克,沃罗尼奇,沃罗诺克,沃罗滕斯克,弗雷夫,弗鲁奇伊,弗谢卢格,维亚蒂奇斯克,维亚特卡,维谢戈罗德,维什戈罗德,维索科耶,亚格尼亚京,亚罗波尔奇,亚谢涅茨,尤里耶夫,尤里耶韦茨,扎赖斯克,日托梅尔,若尔瓦日,日热奇,祖布科夫,祖杰切夫,兹韦尼哥罗德"},

      {name: "北欧 Nordic", i: 6, min: 2, max: 10, d: "kln", m: .1,
        b: "阿克雷里,奥尔德拉,阿尔夫塔内斯,安德内斯,奥斯特博,奥沃格,巴卡弗尤杜尔,巴兰根,巴达尔,贝斯弗尤德,比弗罗斯特,比尔杜达鲁,比耶尔卡,比耶尔克维克,比约尔科森,布里克斯韦尔,布洛肯,布隆杜奥斯,博尔加,博隆加尔维克,博格,博加内斯,博斯缪恩,博斯塔德,博斯特兰德,博茨维卡,布劳塔霍尔特,布雷达尔斯维克,布林斯利,布鲁纳利德,布达尔达卢尔,比格达克亚尼,达尔维克,久皮沃古尔,多内斯,德拉盖德,德朗斯内斯,埃吉尔斯塔迪尔,埃特罗加,埃尔韦内斯,恩加沃根,埃尔滕沃格,埃斯基弗尤杜尔,埃韦内斯,埃亚尔巴基,法格内斯,法尔缪恩,费拉贝尔,费内斯,芬诺亚,菲亚尔,菲耶尔达尔,弗拉克斯塔德,弗拉泰里,弗洛斯特兰德,弗卢迪尔,加达贝尔,加杜尔,吉姆斯塔德,吉沃尔,杰罗伊,格拉德斯塔德,戈多亚,戈多伊内斯,格兰缪恩,格拉夫达尔,格雷尼维克,格里姆赛,格林达维克,格里廷,哈夫尼尔,哈尔萨,豪加内斯,豪格兰德,豪克内斯,赫拉,赫兰德,赫利桑杜尔,赫斯塔德,希格拉夫,赫尼夫斯达卢尔,霍夫恩,霍夫索斯,霍兰德,霍拉尔,霍伦,霍尔克斯塔德,霍尔马维克,霍彭,霍夫登,赫拉夫纳吉尔,赫里塞,胡萨维克,胡斯维克,赫姆斯坦吉,汉内里,赫韦拉格尔迪,赫沃尔索卢尔,伊格罗伊,因德勒,因恩迪尔,因纳哈韦特,因内斯,伊萨弗尤杜尔,亚克劳斯图尔,亚恩斯雷基尔,尤恩克达尔,卡尔德沃格,坎斯塔德,卡尔索伊,卡沃森,凯夫拉维克,谢尔德,谢尔斯塔德,克拉克,科帕斯克,科帕沃古尔,科尔根,克里斯特内斯,克鲁托加,克里斯塔德,克维纳,兰德,劳加尔,劳加拉斯,劳加尔巴基,劳加尔瓦特恩,劳普斯塔德,莱内斯,莱拉,莱伦,莱兰德,莱尼维卡,洛丁,洛丁恩,隆斯巴基,洛普斯马卡,洛文德,卢罗伊,迈拉,梅拉赫韦尔菲,梅洛伊,梅维克,米斯韦尔,莫恩斯,莫斯费尔斯贝尔,莫斯克内斯,米肯,瑙尔斯塔德,内斯贝里,内斯亚赫韦尔菲,内塞特,内韦内斯,奥比格达,奥福滕,奥格斯卡德特,奥克尔维卡,奥克内斯,奥拉夫斯弗尤杜尔,奥尔德维卡,奥尔斯塔德,翁斯塔德,奥佩伊德,奥雷斯维卡,奥尔斯内斯,奥尔斯沃格,奥斯米拉,奥韦达尔,普雷斯托亚,劳达莱库尔,劳法霍夫恩,雷伊波,雷克霍拉尔,雷克霍尔特,雷克亚利德,里夫,里诺亚,罗多伊,罗格南,罗斯维卡,罗维卡,萨尔胡斯,桑登,桑德格尔迪,桑多克,桑德塞特,桑德维卡,绍达克罗库尔,塞尔福斯,塞尔索亚,塞内斯维克,塞索,锡格鲁弗尤杜尔,希尔瓦伦,斯卡加斯特龙德,斯凯尔斯塔德,斯孔兰德,斯科尔沃根,斯克罗瓦,斯勒内塞特,斯努巴,索夫廷,索尔海姆,索尔海马尔,索拉尔诺伊,索尔富格洛伊,索尔兰德,索尔梅拉,索尔韦尔,索维卡,斯塔姆松德,斯塔姆斯维卡,斯塔维,斯托卡,斯托克赛里,斯托约尔德,斯托罗,斯托维卡,斯特兰德,斯特劳门,斯特伦德内,苏达维克,苏杜雷伊,桑多亚,锡达伦,辛格伊里,索拉克霍夫恩,索尔斯霍夫恩,蒂亚纳比格德,蒂奥塔,托斯博特恩,特劳内斯,特罗福斯,特罗内斯,特韦罗,乌尔夫斯沃格,昂斯塔德,乌茨科尔,瓦拉,范德韦德,瓦尔马利德,瓦索斯,韦韦尔斯塔德,维德雷克,维克,维克霍尔门,沃加尔,沃格哈姆,沃普纳弗尤杜尔"},

      {name: "希腊 Greek", i: 7, min: 2, max: 11, d: "s", m: .1,
        b: "阿卑德拉,阿卡奈,艾盖,埃吉纳,阿格里尼翁,艾戈斯塞纳,阿克拉加斯,阿克罗伊农,阿克罗蒂里,阿拉利亚,亚历山大里亚,阿玛林索斯,阿玛塞亚,安菲凯亚,安菲杰尼亚,安菲波利斯,安提帕特里亚,安条基亚,阿帕米亚,阿菲德那,阿波罗尼亚,阿尔戈斯,阿尔特弥塔,阿尔吉罗波利斯,阿斯克勒庇俄斯,雅典,阿斯蒙尼亚,布里托斯,博里斯梯涅斯,布劳隆,比布鲁斯,拜占庭,比提尼翁,卡吕冬,卡迈齐,卡尔基斯,奇俄斯,克利奥那,科尔西拉,克罗通,锡瑞尼,锡塞拉,德塞利亚,德洛斯,德尔斐,迪卡埃尔基亚,迪德玛,迪翁,迪俄斯库里亚斯,多多纳,多里莱翁,埃拉泰亚,埃琉西斯,埃勒夫塞尔纳,恩波里翁,以弗所,埃皮达姆诺斯,埃皮达鲁斯,埃皮泽菲里安,埃律斯,尤贝亚,戈尔基,高诺斯,戈吉皮亚,古尔尼亚,戈尔廷,吉蒂翁,哈吉奥斯,哈利卡纳索斯,赫利俄波利斯,赫勒斯蓬托斯,赫勒罗斯,赫拉克利亚,希拉波利斯,希梅拉,希斯特里亚,胡布拉,希耶勒,雅里索斯,雅索斯,伊达利翁,伊姆布罗斯,伊俄尔科斯,伊塔诺斯,伊萨卡,朱克塔斯,卡利波利斯,卡美罗斯,卡里斯托斯,卡斯梅奈,凯波伊,基梅里孔,克诺索斯,科林斯,科斯,库里翁,基多尼亚,凯里尼亚,拉米亚,兰普萨科斯,劳迪西亚,拉皮索斯,拉里萨,莱贝娜,莱夫卡达,莱凯翁,莱贝特拉,利翁蒂诺伊,利拉伊亚,林多斯,利索斯,马格尼西亚,曼提尼亚,马拉松,马尔马拉,马萨利亚,梅加罗波利斯,梅加拉,梅塔蓬蒂翁,梅图玛,米利都,莫甘蒂娜,穆莱,穆克奈,迈奥尼亚,米拉,密尔梅基翁,迈奥斯,诺普里奥斯,诺克拉蒂斯,诺帕克托斯,纳克索斯,内阿波利斯,涅米亚,尼西亚,尼科波利斯,尼姆法翁,尼萨,奥德索斯,奥尔比亚,奥林匹亚,奥林索斯,奥波斯,奥尔科梅诺斯,奥里科斯,奥雷斯提亚,奥瑞奥斯,安切斯摩斯,帕加赛,帕莱卡斯特罗,潘多西亚,潘提卡派翁,帕福斯,帕尔加蒙,帕罗斯,佩盖,佩利翁,佩赖埃斯,菲斯托斯,法勒隆,法罗斯,皮塞库萨,菲利波波利斯,福凯亚,皮纳拉,皮萨,皮塔内,普拉泰亚,波塞多尼亚,波蒂代亚,普塞拉,赛克罗,普特利奥斯,皮德纳,皮洛斯,皮尔格斯,拉姆诺斯,瑞提姆纳,瑞法埃,瑞齐尼亚,罗得斯,萨拉米斯,萨摩斯,斯凯拉翁,塞琉西亚,塞马索斯,塞斯托斯,斯基德罗斯,锡琉贡,锡诺普,锡里斯,史密那,索佐波利斯,斯巴达,斯塔吉罗斯,斯特拉托斯,斯廷法洛斯,苏巴里斯,苏拉库赛,塔拉斯,塔纳格拉,塔纳伊斯,陶罗梅尼翁,特吉亚,泰姆诺斯,提俄斯,塔普索斯,塔索斯,底比斯,西奥多西亚,泰尔马,塞斯比亚,色罗尼翁,托里科斯,图里伊,赛瑞恩,塞里亚,提索莱亚,托米斯,特拉古里翁,崔波利斯,特罗利顿,特洛伊,提利索斯,提罗斯,瓦希佩特罗斯,萨金索斯,萨克罗斯"},

      {name: "罗马 Roman", i: 8, min: 2, max: 11, d: "ln", m: .1,
        b: "阿比拉,阿德弗列克苏姆,阿德尼克雷姆,埃利亚,埃利乌斯,埃米尼乌姆,埃库姆,阿格里皮娜,阿格里皮奈,阿拉,阿尔巴尼亚尼斯,阿莱里亚,安比亚努姆,安道托尼亚,阿普鲁姆,阿夸埃,阿夸埃格兰尼,阿奎恩西斯,阿奎莱亚,阿奎因库姆,阿赖,阿根托拉图姆,阿里米努姆,阿斯克里维乌姆,阿斯图里卡,阿特雷巴图姆,阿图阿图卡,奥古斯塔,奥雷利亚,奥雷利亚诺鲁姆,巴塔瓦尔,巴塔沃鲁姆,贝卢姆,比里基阿纳,布莱斯蒂乌姆,博纳梅斯,博纳,博诺尼亚,博尔贝托马古斯,博维乌姆,布拉卡拉,布里冈蒂乌姆,布尔戈杜努姆,凯撒奥古斯塔,凯撒雷亚,凯撒罗马古斯,卡列瓦,卡穆洛杜努姆,坎施塔特,坎提亚科鲁姆,卡皮托利纳,卡拉利斯,卡斯特鲁姆,卡斯特拉,卡斯特鲁姆,基巴莱,克劳森图姆,科洛尼亚,孔康吉斯,孔达特,孔弗卢恩特斯,科尼姆布里加,科尔杜巴,科里亚,科里尔陶沃鲁姆,科里尼乌姆,科里奥瓦鲁姆,科尔诺维奥鲁姆,达努姆,戴瓦,迪亚尼乌姆,迪沃杜鲁姆,多布诺鲁姆,德鲁西,杜布里斯,杜姆诺尼奥鲁姆,杜尔诺瓦里亚,杜罗科布里维斯,杜罗科尔诺维乌姆,杜罗利蓬特,杜罗韦尔努姆,杜罗维古图姆,埃博拉库姆,埃布苏斯,埃代塔诺鲁姆,埃梅里塔,埃莫纳,埃莫皮里艾,尤拉奇尼,法文提亚,弗拉维艾,弗洛伦提亚,佛鲁姆,格鲁拉塔,格鲁达,格索斯克里巴特,格列文西乌姆,哈德里亚尼,赫库拉内亚,伊斯卡,伊塔利卡,尤利亚,尤利奥布里根西乌姆,尤瓦武姆,拉克托杜鲁姆,拉根提乌姆,拉普尔杜姆,劳里,莱吉奥尼斯,莱马尼斯,伦提亚,莱皮迪,勒托塞图姆,林迪尼斯,林杜姆,利克苏斯,伦丁尼乌姆,洛波杜努姆,卢松纳,卢库斯,卢格杜努姆,卢古瓦利乌姆,卢泰提亚,曼库尼乌姆,马尔索尼亚,马提乌斯,马萨,马西利亚,马蒂洛,马蒂亚科鲁姆,梅迪奥拉努姆,摩德,摩贡提阿库姆,莫里杜努姆,穆尔萨,奈苏斯,内尔维亚,尼达,尼格鲁姆,诺维西乌姆,诺维奥马古斯,奥利卡纳,奥利西波,奥维拉瓦,帕里西奥鲁姆,帕提斯库姆,帕特尔纳,皮斯托里亚,普拉肯提亚,波伦提亚,波马里亚,庞贝,蓬斯,波尔图斯,普雷托里亚,普雷托里乌姆,普卢姆,拉古西乌姆,拉特埃,劳里卡,拉韦纳,雷吉纳,雷吉乌姆,雷古尔比乌姆,里戈马古斯,罗马,罗穆拉,鲁图皮艾,萨拉索鲁姆,萨勒努姆,萨洛纳,斯卡拉比斯,塞戈维亚,西卢鲁姆,西尔米乌姆,西斯基亚,索尔维奥杜鲁姆,苏梅洛肯纳,塔拉科,陶里诺鲁姆,特兰达,特拉耶克图姆,特雷韦罗鲁姆,通格罗鲁姆,图里库姆,乌尔皮亚,瓦伦提亚,威尼提艾,文塔,维鲁拉米乌姆,维松提奥,维泰拉,维多利艾,维克特里克斯,维拉,维米纳西乌姆,温德利科鲁姆,温多博纳,维诺维亚,维罗科尼乌姆"},

      {name: "芬兰 Finnic", i: 9, min: 2, max: 11, d: "akiut", m: 0,
        b: "阿内科斯基,阿赫莱宁,阿霍兰瓦拉,阿赫塔里,艾亚拉,阿卡,阿拉雅尔维,安特斯拉,阿斯波,贝纳斯,比约尔科比,埃尔瓦,埃马萨洛,埃斯波,埃塞,埃维茨科格,福尔萨,哈帕马基,哈帕韦西,哈帕萨卢,哈梅恩林纳,汉科,哈尔亚瓦尔塔,哈图瓦拉,豪塔雅尔维,哈武马克伊,海诺拉,赫塔,欣卡博勒,希尔穆拉,霍萨,胡伊蒂宁,胡苏拉,希吕拉,海温卡,伊卡利宁,伊斯克莫,伊塔科斯基,贾姆萨,亚尔文帕,耶波,吉奥苏,吉奥格瓦,约恩苏,约基库拉,容斯恩德,于韦斯库拉,卡马斯穆卡,卡亚尼,卡拉约基,卡拉斯特,坎坎帕,卡尔库,卡尔潘库拉,卡斯基宁,卡斯纳斯,考哈约基,考哈瓦,考尼艾宁,考瓦察,凯赫拉,凯洛科斯基,凯洛蒂雅尔维,凯米,凯米雅尔维,凯拉瓦,克尤鲁,基尔亚瓦,基乌鲁韦西,基韦斯雅尔维,基维约利,基维苏奥,克劳卡拉,克洛夫斯科格,科赫特拉雅尔维,科凯马克伊,科科拉,科尔霍,科斯库埃,科特卡,库瓦,考普宁基,库赫莫,库恩达,库奥皮奥,库雷萨雷,库里卡,库萨莫,库尔马兰库拉,拉赫蒂,莱蒂拉,兰基波哈,兰西库拉,拉普阿,劳里拉,劳蒂奥萨里,伦帕阿拉,莱普萨马,利耶达卡拉,列克萨,利托伊宁,洛伊哈,洛伊迈阿,洛克萨,洛维萨,马尔米,曼塔,马塔斯瓦拉,毛拉,米卢兰塔,米奥萨库拉,穆纳皮尔蒂,穆斯特韦,穆拉海宁,纳恩塔利,纳帕,纳尔皮奥,尼尼马阿,尼尼萨洛,尼基拉,尼尔西亚,尼瓦拉,诺基亚,努梅拉,努奥尔甘,努乌武斯,奥布纳斯,奥伊蒂,奥亚卡拉,奥尼宁,奥里马蒂拉,奥里韦西,奥坦马克伊,奥塔瓦,奥特帕阿,奥乌莱宁,奥卢,帕沃拉,帕伊德,派米奥,帕坎库拉,帕尔迪斯基,帕莱宁,帕尔库马克伊,帕罗拉,佩尔图拉,皮埃克萨马克伊,皮奥尔查马阿,皮奥尔瓦,波哈亚拉,波尔霍拉,波拉萨,波尔沃,普达斯雅尔维,普尔莫,普亚哈雅尔维,拉赫,拉塞波里,莱西奥,拉雅马克伊,拉克韦雷,拉皮纳,拉普拉,劳马,劳蒂奥,雷波萨里,里希马基,罗瓦涅米,罗伊卡,鲁奥纳拉,鲁奥塔拉,鲁塔拉希蒂,萨里雅尔维,萨洛,萨斯塔马拉,绍埃,萨沃恩林纳,赛伊纳约基,西拉迈,修恩蒂奥,松普雅尔维,苏翁约基,苏雷贾尼,西尔延塔卡,塔姆萨卢,塔帕,泰梅斯,提奥尔瓦,托尔马森瓦拉,托尔尼奥,托蒂雅尔维,图尔皮奥,图伦基,图里,图卡拉,图乌拉拉,图乌里,图乌斯基,图乌斯涅米,乌尔维拉,乌纳里,乌平涅米,乌蒂,乌斯基考宁基,瓦克西,瓦利迈阿,瓦林玛亚,瓦萨,瓦伊尼卡拉,瓦尔加,瓦尔凯科斯基,凡塔,瓦尔考斯,韦赫卡佩拉,韦赫马斯马克伊,维耶基,维耶鲁马克伊,维塔萨里,维尔扬迪,维尔普拉,维奥马,维奥鲁,维拉特,伊里克,伊利维埃斯卡,伊洛雅尔维"},

      {name: "朝鲜 Korean", i: 10, min: 2, max: 11, d: "", m: 0,
        b: "安中,安山,安城,安养,阿帕,阿浦,白石,白水,贝尔桥,保恩,保城,釜山,扶余,昌宁,昌原,天安,清道,清津,清松,清阳,铁原,叱原,春川,忠州,大德,大伽倻,大田,丹阳,唐津,达沙,东海,东松,道阳,延阳,开城,江庆,江华,江陵,甘城,加云,巨昌,巨济,建川,金虎,金日,金王,奇章,金川,金和,金堤,高阿,高昌,高汉,公都,公州,高城,高阳,九美,军浦,军산,九里,谷里,光州,光阳,观山,京城,河东,咸昌,咸平,咸烈,河南,合川,河阳,兴南,红农,红城,华川,华岛,华城,华顺,华原,香南,仁川,仁济,伊里,长港,长兴,长城,长胜浦,长寿,制川,济州,点村,郑邑,正官,正州,正玉,正川,全州,指岛,直山,真安,真川,真岛,真建,真折,真南浦,真营,佐川,佐治院,佐里,麦浦,满京,木浦,武州,文山,内水,罗州,南海,南原,南阳,南阳州,农公,论山,五川,玉川,玉区,五南,温山,温阳,五浦,庞城,浦谷,浦胜,风山,平昌,平海,平阳,沙比,沙川,三陟,三湖,三礼,山青,上洞,上州,塞桥,沙里院,世宗,西川,西归浦,城欢,城镇,城州,城南,城山,西山,胜州,市兴,新洞,新泰仁,素赫,速草,松岳,松亭,松林,松潭,顺川,太安,太白,通津,义政府,义嶺,义王,蔚珍,蔚陵,云峰,熊川,雄津,外官,完岛,瓦阳,威礼城,元德,阳州,阳山,阳阳,礼川,盐池,延川,英岩,英川,英德,英东,英光,英州,英月,英阳,延日,龙仁,龙津,裕谷"},

      {name: "中华 Chinese", i: 11, min: 2, max: 10, d: "", m: 0,
        b: "阿迷,爱州,安北,安本,安昌,安德,安定,安东,安丰,安和,安化,安吉,安郎,安老,安乐,安立,安陆,安谟,安南,安宁,安平,安铺,安庆,安丘,安仁,安塞,安顺,安肃,安西,安喜,安阳,安邑,安远,安越,安岳,安州,巴东,巴阆,巴陵,巴西,巴县,巴中,巴州,霸州,白河,白马,白水,柏乡,白州,保安,保昌,褒城,保德,宝坻,保定,宝丰,保福,枹罕,宝鸡,保禄,保宁,宝庆,宝山,保山,宝应,保州,北海,北江,杯兰,北流,北平,北胜,北庭,北直,贝州,泌阳,壁州,辩州,汴州,别称,宾川,邠州,宾州,滨州,并州,博白,播川,僰道,博陵,博平,博兴,博野,亳州,博州,播州,布,蔡州,苍梧,沧州,曹县,曹州,茶偈,茶陵,镡津,单于,澶州,长安,常德,常丰,昌化,场津,长乐,常乐,昌黎,常林,昌平,长沙,常山,常熟,长汀,昌邑,昌元,昌州,常州,朝城,超类,巢县,潮阳,朝邑,潮州,陈留,郴县,郴州,陈州,辰州,成安,澄城,成都,城固,承化,成纪,澂江,承天,城武,成县,成州,澄州,茌平,池州,崇明,重庆,崇庆,崇善,崇信,楚雄,楚州,滁州,处州,淳化,春州,慈廉,慈山,磁州,慈州,从质,大城,大慈,大渎,大理,大蛮,大名,大宁,大堂,大同,大湾,大乡,大兴,大寅,大庾,达州,代郡,代州,丹巴,丹山,丹徒,单县,丹阳,丹杨,丹裔,儋州,丹州,当道,砀山,当涂,当州,宕州,党州,道,道州,德安,德化,德平,德庆,德阳,德州,邓川,登封,邓州,登州,狄道,底江,棣州,叠州,定安,定边,定城,定川,定番,定廉,定辽,定陶,定襄,定兴,定远,定州,董,东安,东岸,东昌,东潮,东川,东都,东阿,东关,东光,东海,东结,东莱,东栏,东兰,东流,东明,东牟,东平,东山,东胜,洞喜,东阳,都畿,都结,都康,都匀,窦州,独山,端溪,端州,堆海,敦煌,顿丘,多阁,多混,多锦,多翼,俄乐,峨石,鄂州,恩平,恩县,恩州,繁昌,范县,范阳,繁峙,房陵,房山,方义,房州,坊州,肥城,费县,肥乡,费州,汾西,汾阳,汾州,封川,奉化,奉节,封丘,丰润,凤山,俸田,丰县,凤县,凤翔,凤阳,奉议,冯翊,丰盈,丰州,凤州,封州,峰州,府,福安,阜城,涪川,扶凤,扶沟,府谷,福建,福康,符离,富良,富林,涪陵,芙蒥,扶隆,福禄,扶南,福宁,抚宁,扶宁,阜平,富平,伏羌,芙蓉,福山,浮山,肤施,富水,符阳,滏阳,富峪,抚州,福州,复州,富州,鄜州,扶州,涪州,府／,盖州,感化,甘泉,赣县,感义,赣榆,甘州,赣州,冈州,高安,藁城,高淳,高凉,高陵,高密,高平,高山,高台,高唐,高阳,高要,高邑,高邮,高苑,高州,巩昌,弓高,恭化,恭顺,巩县,恭州,龚州,固安,古榜,故城,古邓,古杜,古费,古弘,古兰,古浪,古雷,古礼,古陇,古农,古平,固始,古藤,古勇,固原,姑臧,古者,古州,瓜州,观城,管城,关内,馆陶,冠县,广安,广昌,广德,广东,广陵,广灵,广南,广宁,广平,光山,广顺,广威,广西,广信,广邑,广源,广州,光州,广宗,归诚,贵池,妫川,归德,归化,桂林,桂平,归善,归顺,贵乡,贵阳,桂阳,桂州,贵州,巂州,妫州,归州,果化,崞县,虢州,果州,海丰,海康,海口,海门,海阳,海州,韩城,邯郸,汉东,含山,汉阳,汉阴,汉源,汉中,汉州,杭州,濠州,河北,河池,合川,河东,合肥,河瑰,河华,河黄,和集,河间,河津,河南,河内,合浦,鹤庆,河曲,和曲,合水,贺水,和顺,河西,河阳,郃阳,和义,河阴,和政,河中,和州,合州,贺州,河州,横山,衡水,衡阳,横州,衡州,洪洞,弘农,虹县,洪源,洪州,壶关,湖广,鄠县,虎岩,湖州,化城,华亭,滑县,华阴,化州,华州,滑州,淮安,怀安,怀道,怀德,怀来,淮南,怀宁,怀庆,怀仁,怀戎,怀柔,淮阳,淮阴,怀远,怀泽,怀州,环县,驩州,环州,黄冈,黄平,湟水,黄县,黄州,会稽,会江,回乐,会宁,辉县,会州,徽州,惠州,浑源,获嘉,获鹿,霍丘,霍山,漷县,霍州,吉安,吉昌,偈江,汲郡,鸡陵,即墨,济南,济宁,稷山,绩溪,蓟县,汲县,济阳,济阴,济源,鸡泽,吉州,冀州,蓟州,集州,嘉诚,嘉定,嘉林,郏县,嘉祥,嘉兴,葭州,嘉州,建安,建昌,剑川,建德,剑南,建宁,建平,建水,剑州,简州,建州,江都,江华,绛郡,江口,将利,江陵,江南,江宁,江浦,江西,江夏,江阴,江油,江源,江州,奖州,绛州,交城,交川,胶海,交河,胶水,教义,交趾,交州,胶州,结安,结伦,介休,结悦,阶州,解州,晋昌,晋城,金城,金华,晋江,晋康,晋陵,金满,晋宁,金坛,金县,金乡,晋阳,晋原,缙云,金州,晋州,锦州,靖安,景城,京城,静川,旌德,景东,静海,京畿,靖江,井径,泾口,静乐,竟陵,靖虏,荆门,静宁,井坪,静戎,京山,京师,泾县,泾阳,京兆,静州,泾州,靖州,景州,荆州,九德,九江,九陇,酒泉,九原,九真,巨津,巨鹿,钜鹿,句容,巨野,莒州,鄄城,浚县,浚仪,均州,开封,开江,开平,开阳,开州,康州,考城,岢岚,库,快州,宽河,旷,夔州,昆明,昆山,昆阳,廓州,来安,来宾,涞水,莱芜,莱阳,莱州,蓝田,岚县,兰阳,岚州,兰州,朗宁,琅邪,阆中,阆州,朗州,牢州,乐,乐安,乐陵,乐平,乐亭,乐兴,磊江,雷州,黎城,历城,利调,利逢,丽江,利津,黎平,醴泉,利仁,立山,离石,立石,溧水,丽水,蠡县,礼县,历阳,溧阳,澧阳,澧州,利州,黎州,连城,连平,连山,连州,廉州,两当,良德,谅江,梁江,梁泉,谅山,梁县,良乡,梁州,凉州,聊城,辽东,辽海,辽山,辽州,临安,临城,临川,临汾,临封,临桂,临海,临贺,临淮,临江,临晋,临清,临邛,临朐,临汝,潾山,临潭,临洮,临汀,临潼,临县,林县,临沂,临邑,临翼,临颍,麟游,临漳,临州,麟州,临淄,灵宝,灵璧,灵昌,陵川,岭方,零陵,岭南,灵丘,灵石,灵寿,陵水,灵台,灵武,灵溪,陵县,陵州,灵州,柳城,六合,流江,柳州,笼,龙安,陇拔,龙标,龙城,龙池,隆德,龙冈,龙门,隆平,龙平,泷水,龙水,陇西,龙溪,龙英,陇右,龙游,笼州,陇州,龙州,泷州,楼烦,潞安,六安,潞城,泸川,庐江,泸江,鲁郡,陆凉,庐陵,卢龙,陆那,路南,路平,禄劝,卢山,鲁山,卢氏,卢溪,卢阳,鹿邑,陆泽,泸州,陆州,禄州,潞州,庐州,栾城,峦州,滦州,洛川,罗定,洛交,雒南,罗平,罗山,雒县,洛阳,洛州,罗州,略阳,麻哈,马湖,马龙,麻笼,马平,麻溪,马邑,满城,茂名,鄮县,茂州,美良,美禄,郿县,眉州,蒙,蒙城,孟定,孟艮,蒙化,孟津,蒙山,孟县,蒙阳,蒙阴,蒙州,孟州,蒙自,弥勒,密县,密云,米脂,泌州,密州,渑池,绵谷,沔县,沔阳,绵州,闽县,岷州,鸣沙,茗盈,明州,洺州,莫县,莫州,睦州,那岸,那地,南安,南宾,南策,南昌,南城,南充,南川,南丹,南宫,南海,南和,难江,南靖,南京,南康,南乐,南陵,南灵,南流,南宁,南潘,南皮,南平,南浦,南溪,南雄,南阳,南召,南郑,南直,南州,内黄,内丘,内乡,碾伯,宁波,宁国,宁海,宁晋,宁津,宁陵,宁浦,宁羌,宁仁,宁塞,宁朔,宁夏,宁乡,宁阳,宁夷,宁远,宁越,宁州,甯州,农贡,弄石,诺水,盘石,磐石,潘州,沛郡,沛县,彭城,蓬莱,蓬山,彭水,彭原,彭州,蓬州,披,丕禄,邳州,平,平定,平度,平高,平谷,平河,平棘,平乐,平利,平立,平凉,平陆,平虏,平南,平山,屏山,平顺,平武,凭祥,平乡,平阳,平遥,平阴,平原,平越,平州,鄱阳,普安,蒲城,蒲浪,普宁,蒲台,蒲苔,莆田,蒲县,濮阳,濮州,蒲州,普州,齐安,蕲春,齐东,齐河,奇罗,祁门,岐山,栖霞,郪县,祁县,杞县,七源,齐州,蕲州,祁州,岐州,迁安,千冬,潜山,钱塘,前庭,犍为,汧阳,汧源,黔中,虔州,黔州,乾州,谯郡,谯县,琴,秦安,钦江,沁水,溱溪,沁源,秦州,溱州,沁州,钦州,勤州,清安,清波,青城,清池,庆都,清丰,清河,清化,青涧,清江,清廉,青林,清流,清沔,清平,青浦,清水,清潭,清威,青县,庆阳,青阳,清源,清苑,庆远,清远,庆云,青州,庆州,琼林,琼山,琼州,邛州,龟兹,秋浦,丘温,丘县,曲阜,曲江,曲靖,朐山,曲水,曲沃,曲阳,曲周,衢州,渠州,全椒,全茗,全宁,泉州,全州,确山,瀼江,穰县,瀼州,饶阳,饶州,任丘,仁寿,任县,日南,日照,容,容城,融水,荣懿,戎州,融州,容州,荣州,如敖,如皋,儒林,汝南,汝宁,汝阳,汝阴,汝州,芮城,瑞州,润州,三带,三河,三江,三水,三万,三原,沙河,沙南,沙州,善才,山丹,山定,山东,山江,陕郡,善劳,山南,善誓,山围,陕西,山西,陕县,山阳,善阳,山阴,鄯州,陕州,上蔡,商城,上党,上谷,上海,商河,上洪,上郡,上林,上禄,上洛,商南,商丘,上饶,上石,商水,上思,上文,上下,上县,上映,上元,商州,邵武,绍兴,邵阳,韶州,邵州,舍城,歙县,涉县,歙州,神木,沈丘,神溪,莘县,沈阳,深泽,申州,深州,盛山,升州,胜州,始安,石城,石埭,施化,石镜,石龙,石楼,石南,始宁,石屏,石阡,石泉,士荣,石室,石塘,始兴,石州,施州,师宗,寿春,寿光,收物,寿阳,寿张,寿州,舒城,束鹿,蜀县,属县,沭阳,属州,舒州,蜀州,税课,水浪,水棠,水屋,顺德,顺化,顺宁,顺庆,顺为,顺义,顺政,顺州,朔方,朔州,思城,泗城,四川,思恩,思陵,四忙,思明,思南,司农,四岐,思容,汜水,泗水,思唐,思州,泗州,宋城,松江,宋江,嵩明,宋平,嵩县,松州,宋州,肃宁,宿迁,宿松,宿州,肃州,苏州,绥德,睢宁,遂宁,遂平,隋县,睢阳,绥阳,绥州,遂州,隋州,睢州,随州,泰安,太仓,太古,太和,太湖,太康,太平,泰兴,太原,台州,泰州,郯城,潭阳,潭州,檀州,唐安,唐朝,唐濠,唐江,唐林,汤泉,唐山,唐县,堂邑,汤阴,汤州,洮江,桃源,洮州,滕县,腾越,藤州,天保,天成,天水,天长,田州,铁岭,廷河,庭州,汀州,通安,同安,桐柏,同昌,桐城,潼川,通川,同谷,同官,通轨,通海,通化,同利,铜陵,统宁,铜仁,通渭,通许,通义,通州,同州,土黄,土油,屯留,屯山,脱,沱江,万安,万承,万宁,宛平,宛丘,万泉,万全,完县,万崖,万州,望江,望瀛,维川,洧川,卫辉,魏郡,威蛮,维摩,渭南,卫山,尉氏,魏县,潍县,威县,威远,渭源,维州,韦州,卫州,威州,蔚州,渭州,魏州,文安,文城,文德,文登,文盘,汶山,汶上,温水,文水,闻喜,文县,温县,阌乡,文阳,文杨,文振,文州,温州,武安,吴堡,武昌,乌程,武城,务川,武当,武定,武都,武峨,武冈,武功,五河,芜湖,武化,无极,吴江,武进,吴郡,乌拉,武郎,乌雷,武礼,武陵,乌蒙,武宁,武强,吴桥,武勤,武清,武曲,乌撒,五台,武威,无为,无锡,吴县,武乡,吴兴,舞阳,武邑,婺源,五原,武陟,婺州,梧州,武州,西安,西城,淅川,隰川,嶍峨,西固,西关,西河,西和,西华,细江,西栏,西宁,西平,悉唐,息县,西乡,西真,悉州,西州,隰州,溪州,下洪,夏华,夏津,下雷,瑕丘,峡山,下石,下思,下文,夏县,夏邑,夏州,峡州,仙吕,咸宁,县数,献县,咸阳,仙游,宪州,相城,襄城,祥符,香河,象郡,襄陵,乡宁,向武,襄武,襄阳,襄垣,相州,襄州,象州,萧关,萧县,信安,新安,新蔡,新昌,忻城,新城,新定,信都,新福,新贵,新河,新化,新会,新乐,新宁,新平,新秦,新泰,新乡,新兴,信阳,新野,信义,新郑,新州,忻州,信州,兴安,兴德,兴国,兴和,荥河,兴化,兴济,兴平,邢台,兴唐,行唐,兴武,兴县,荥阳,兴元,荥泽,邢州,兴州,星子,雄县,休宁,秀容,修武,绣州,须昌,旭川,徐沟,盱眙,徐州,许州,叙州,宣城,宣德,宣府,宣化,宣江,宣州,薛城,循德,寻甸,浔江,洵阳,浔阳,浔州,循州,衙仪,崖州,雅州,延安,延长,郾城,盐城,延川,厌次,严道,延德,延恩,延津,鄢陵,雁门,延平,延庆,燕然,盐山,偃师,盐州,延州,岩州,演州,兖州,严州,杨,阳安,阳城,洋川,阳春,阳谷,阳和,养利,阳曲,阳武,洋县,阳信,洋州,扬州,姚安,姚城,耀州,姚州,夜度,邺郡,夜郎,叶县,掖县,乙,乂安,懿安,宜宾,益昌,翼城,宜川,义川,宜春,益都,宜芳,仪封,倚郭,宜君,溢乐,夷陵,义伦,义泉,宜山,猗氏,沂水,伊吾,易县,黟县,峄县,宜兴,义阳,宜阳,弋阳,伊阳,仪真,益州,夷州,伊州,义州,翼州,易州,沂州,宜州,银川,阴平,鄞县,银州,颍川,营道,应灵,应平,英山,颍上,营州,瀛洲,应州,颍州,郢州,永安,永昌,永城,永定,永丰,永和,永涸,永嘉,永江,永康,永年,永宁,永平,永清,永寿,永通,雍县,永阳,邕州,雍州,永州,油江,宥州,幽州,禹城,虞城,榆次,域个,余杭,郁林,玉林,榆林,榆木,玉山,榆社,鱼台,玉田,渔阳,馀姚,豫章,禺州,裕州,禹州,渝州,渊,元城,元江,缘觉,元郎,沅陵,垣曲,元氏,原武,袁州,原州,沅州,越巂,岳阳,越州,岳州,云安,郓城,云川,云浮,云龙,云南,云屯,郧县,郧阳,云中,云州,郓州,赞皇,枣强,泽州,乍今,沾化,沾益,彰德,长葛,长津,漳浦,长清,章丘,长山,长社,长武,漳县,张掖,长垣,长治,长洲,漳州,长州,长子,赵城,昭德,赵郡,肇庆,招义,招远,赵州,昭州,柘城,浙江,柘县,柘州,真安,镇安,镇北,真定,镇番,真符,镇江,镇康,真利,镇虏,镇蛮,镇南,镇宁,真宁,镇平,镇朔,镇雄,真阳,镇夷,镇原,镇远,镇沅,镇州,振州,真州,政和,正平,整平,政平,郑县,郑州,支俄,支封,直福,知见,直隶,至灵,支罗,治所,芝州,中部,中都,钟离,中牟,钟祥,忠义,忠州,州府,州治,盩厔,诸城,祝水,珠崖,庄浪,涿郡,涿鹿,涿州,淄川,秭归,梓潼,滋阳,资阳,紫阳,自在,资州,梓州,淄州,邹平,邹县,遵化,遵义,胙城,左封,左平,左州"},

      {name: "日本 Japanese", i: 12, min: 2, max: 10, d: "", m: 0,
        b: "安平,阿贺,爱川,会津美里,鲇泽,厚岸,天城,阿见,安堵,浅川,芦北,磐梯,平取,长南,江差,府中,富士见,舟形,玄海,神户,五霞,五户,玉东,羽幌,滨顿别,播磨,阶上,早岛,平群,日高,东浦,平内,广川,广尾,帆立清水,伯耆,北荣,北龙,幌加内,揖斐川,市贵,市川,一户,饭岛,饭纲,井川,猪名川,板仓,岩泉,岩手,开成,上富良野,上板,上岛,上川,上士幌,神山,神田,神流,笠置,粕屋,胜浦,川边,川本,川根本,川西,川原,川崎,川棚,河津,纪北,木古内,金,木曾,北形,北岛,基山,清里,甲府,上毛,湖北,九重,甲良,甲佐,琴平,九度山,久米岛,久米南,久御山,国富,藏手,串本,俱知安,鋸南,京丹波,增毛,松前,御船,美滨,南部,南越前,南种子,美咲,三朝,美里,宫代,三好,森,妹背牛,睦泽,长泉,长瀞,长与,和水,中泊,中之条,中标津,滑川,南部,南幌,直岛,那须,二世古,西原,西伊豆,西桂,西川,西之岛,西和贺,野木,能登,入善,大洗,小布施,大台,大河原,大治,奥入濑,大石田,大磯,大泉,王子,冈垣,奥多摩,雄武,小野,大坂,乙部,大月,大鹫,礼文,利府,陆别,利尻,六户,龙王,坂,佐久穂,样似,萨摩,佐用,佐佐,濑棚,积丹,芝山,志贺,岛本,清水,新富,白川,酒水,设乐,壮瞥,须惠,住田,周防大岛,寿都,田布施,筑后,只见,忠冈,太地,大树,高千穂,高滨,武丰,多良木,立科,龙郷,田原本,弟子屈,砥部,时川,当麻,富冈,土庄,土佐,丰頃,丰富,丰山,津幡,津别,月形,都农,津和野,宇美,若狭,山元,山边,矢祭,柳津,安田,余市,与那国,养老,吉野,汤别,汤河原,由仁,檮原,游佐"},

      {name: "葡萄牙 Portuguese", i: 13, min: 2, max: 11, d: "", m: .1,
        b: "阿布里加达,阿丰索埃罗,阿格达,阿吉拉达,阿拉戈阿斯,阿拉戈因哈斯,阿尔布费拉,阿尔坎霍斯,阿尔科巴萨,阿尔科廷,阿尔多阿尔,阿伦克尔,阿尔费泽朗,阿尔加维,阿尔马达,阿尔马格雷拉,阿尔梅林,阿尔帕良,阿尔佩德里尼亚,阿尔沃拉达,阿米埃拉,阿纳波利斯,阿佩拉桑,阿兰尼亚什,阿尔加尼尔,阿尔马桑,阿森塞拉,阿威罗,阿维拉尔,巴尔萨斯,巴尔卡雷纳,巴雷拉斯,巴雷图斯,巴塔利亚,贝拉,贝纳文特,贝廷,布拉加,布拉干萨,巴西利亚,布雷若,卡贝塞拉斯,卡贝德洛,卡乔埃拉斯,卡达法伊斯,卡兰德里斯,卡尔赫塔,卡米尼亚,坎皮纳斯,卡尼德洛,卡诺阿斯,卡皮尼亚,卡尔莫埃斯,卡塔绍,卡尔瓦利亚尔,卡尔沃埃鲁,卡斯卡韦尔,卡斯塔尼亚尔,卡希亚斯,沙帕迪尼亚,查维斯,科卡伊斯,科恩特拉尔,科英布拉,孔波尔塔,孔德,科凯里尼奥,科鲁什,达马亚,多乌拉杜斯,恩沙梅斯,埃里塞拉,埃尔维代尔,埃斯卡良,埃斯莫里什,埃斯皮尼亚尔,埃斯特拉,埃斯托里尔,尤纳波利斯,埃武拉,法马利康,范霍伊斯,法罗,法蒂玛,费尔盖拉什,费雷拉,菲盖拉,弗莱谢拉斯,弗洛里亚诺波利斯,福尔纳利亚什,福塔雷萨,弗雷里亚,弗雷谢拉,弗龙泰拉,丰当,格拉萨斯,格拉迪尔,格莱因霍,格拉列拉,吉马良斯,奥尔塔,伊利亚武,伊利乌斯,拉热斯,拉各斯,拉兰热拉斯,拉瓦科略什,莱里亚,利莫埃鲁,利尼亚雷斯,里斯本,隆巴,洛尔旺,洛里卡尔,洛里尼亚,卢济阿尼亚,马塞杜,马查瓦,马尔韦拉,马里尼亚伊什,马西阿尔,梅亚利亚达,米利亚拉杜,米拉,米兰德拉,莫加多鲁,蒙塔莱格雷,莫朗,内斯佩雷拉,尼洛波利斯,奥比杜斯,奥德米拉,奥迪韦拉什,奥埃拉斯,奥莱鲁什,奥尔哈尔武,奥林达,奥利瓦尔,奥利韦拉,奥利韦里尼亚,帕尔赫罗斯,帕尔梅拉,帕尔米塔尔,潘皮略萨,潘塔纳尔,帕拉迪尼亚,帕雷勒罗斯,佩德罗西尼奥,佩戈因斯,佩纳菲耶尔,佩尼切,皮尼昂,皮涅罗,蓬巴尔,蓬塔尔,蓬蒂尼亚,波尔特尔,波尔蒂芒,夸尔泰拉,凯卢斯,哈马尔哈尔,雷博雷拉,累西腓,雷迪尼亚,里巴多罗,里贝拉,里贝朗,罗萨伊斯,萨布加尔,萨卡维姆,萨格里什,桑迪姆,桑加略什,圣塔伦,桑托斯,萨里略什,塞沙什,塞伊舍泽卢,塞伊舒,席尔瓦雷什,席尔韦拉,西尼昂,辛特拉,索布拉尔,索布拉利纽,塔布阿科,塔布雷鲁,塔维鲁,特伊索索,特尔哈杜,特尔海鲁,托马尔,托雷拉,特兰科索,特罗维斯卡尔,瓦戈什,瓦尔泽阿,韦拉什,维亚芒,维亚纳,维迪加尔,维迪盖拉,维杜阿尔,维拉马尔,维梅鲁,维尼亚伊什,维多利亚"},

      {name: "纳瓦特尔 Nahuatl", i: 14, min: 2, max: 13, d: "l", m: 0,
        b: "阿卡普尔科,阿卡特佩克,阿卡特兰,阿卡索奇特兰,阿科尔曼,阿克托潘,阿夸马纳拉,阿华卡特兰,阿尔莫洛亚,阿马库扎克,阿马纳尔科,阿马萨克,阿帕斯科,阿佩塔提特兰,阿皮扎科,阿滕科,阿蒂萨潘,阿特拉科穆尔科,阿特拉佩克斯科,阿托托尼尔科,阿萨普斯科,阿索奇亚潘,阿索科马尼特拉,阿苏特拉,阿斯卡波察尔科,阿斯塔华坎,卡利马亚,卡尔纳利,卡尔普拉尔潘,卡莫特兰,卡普尔瓦克,查尔科,查普尔瓦坎,查普尔特佩克,恰潘,恰乌滕潘,奇科瑙特拉,奇瓦瓦,奇尔夸特拉,奇马尔瓦坎,乔洛兰,奇瓦特兰,科阿韦拉,科阿特佩克,科阿特特尔科,科阿特兰,科阿特林昌,科阿察科阿尔科斯,科科蒂特兰,科赫萨拉,科利马,科洛特兰,科约阿坎,科约瓦坎,夸皮亚斯特拉,夸乌纳瓦克,夸乌特莫克,夸乌蒂特兰,夸乌特佩克,夸乌特拉,夸索穆尔科,库尔瓦坎,埃卡特佩克,埃洛索奇特兰,埃帕特兰,埃帕索尤坎,华曼特拉,华斯卡萨洛亚,华特拉特劳卡,华乌特拉,韦韦特兰,韦韦托卡,韦肖特拉,韦亚潘,韦约特利潘,韦伊波斯特拉,维查潘,维米尔潘,维奇齐拉克,伊斯塔帕洛坎,伊斯塔卡尔科,伊斯塔奇瓦特尔,伊斯塔帕拉帕,洛洛特拉,马利纳尔科,马帕奇特兰,马萨特佩克,马萨特兰,梅特佩克,梅茨提特兰,墨西哥,米亚卡特兰,米却肯,米纳蒂特兰,米斯科阿克,米斯特拉,莫尔卡夏克,纳纳卡米尔帕,瑙卡尔潘,瑙潘,内斯特拉尔潘,内萨瓦尔科约特尔,诺帕卢坎,瓦哈卡,奥科特佩克,奥科蒂特兰,奥科特兰,奥科约阿卡克,奥奎兰,奥奎图科,奥米特兰,奥通潘,奥佐洛阿潘,帕库拉,帕瓦特兰,帕诺特拉,帕帕洛特拉,帕特拉奇坎,皮亚斯特拉,波波卡特佩特尔,苏尔特佩克,特卡马克,特科洛特兰,特科萨乌特拉,特马马特拉,特马斯卡拉帕,特米斯科,特莫阿克,特莫亚亚,特纳尤卡,特诺奇提特兰,特奥奎特拉特兰,特奥蒂瓦坎,特奥特拉尔科,特佩阿卡克,特佩阿普尔科,特佩华坎,特佩蒂特兰,特佩扬科,特波索特兰,特波兹特兰,特特卡拉,特特拉特劳卡,特斯卡尔亚卡克,特斯科科,特索恩特佩克,特索尤卡,蒂米尔潘,蒂萨潘,蒂萨尤卡,特拉科潘,特拉科滕科,特拉瓦克,特拉韦利尔潘,特拉维尔特帕,特拉尔马纳尔科,特拉尔内潘特拉,特拉尔潘,特兰奇诺尔,特拉特洛尔科,特拉斯卡拉,特拉斯科阿潘,特拉亚卡潘,托卡特兰,托尔卡尤卡,托卢卡,托纳尼特拉,托南钦特拉,托纳蒂科,托托拉克,托托拉潘,托托特兰,图奇特兰,图兰特佩克,图尔特佩克,宗潘特佩克,沙拉特拉科,沙洛斯托克,沙尔托坎,希洛索奇特拉,索奇亚蒂潘,索奇科阿特兰,索奇米尔科,索奇特佩克,索洛特兰,索纳卡特兰,亚华利卡,亚乌特佩克,耶卡皮斯特拉,耶华尔特佩克,萨卡特卡斯,萨卡佐纳潘,萨科阿尔科,萨夸尔潘,萨夸尔蒂潘,萨波特兰,锡马潘,锡纳坎特佩克,索亚尔特佩克,宗帕瓦坎"},

      {name: "匈牙利 Hungarian", i: 15, min: 2, max: 13, d: "", m: 0.1,
        b: "阿包,阿巴德萨洛克,阿多尼,阿亚克,阿尔贝提尔沙,奥尔索佐尔察,阿索德,巴博尔纳,巴奇奥尔马什,巴克塔洛兰塔哈扎,巴拉绍吉奥尔马特,巴拉顿阿尔马迪,巴拉顿博格拉尔,巴尔卡尼,鲍尔马祖伊瓦罗斯,巴尔乔,巴陶塞克,巴陶尼泰伦耶,巴托尼亚,贝凯什,贝赖焦于伊法卢,贝尔希达,比亚托尔巴吉,比奇凯,比哈尔克雷什泰什,博道伊克,博伊,博尼哈德,布达卡拉兹,布达克西,采尔多默尔克,察克瓦尔,岑杰尔,琼格拉德,乔尔瑙,乔尔瓦什,丘尔戈,达巴什,代梅切尔,代雷奇克,代瓦瓦尼亚,代韦切尔,东博瓦尔,栋布拉德,杜瑙福尔德瓦尔,杜瑙哈拉斯蒂,杜瑙瓦尔尚,杜瑙韦奇,埃代伦,埃莱克,埃莫德,恩奇,恩英,厄尔奇,费杰维尔内克,费黑尔吉奥尔马特,费尔索佐尔察,费尔图圣米克洛什,福纽德,福特,弗泽沙博尼,弗泽什吉奥尔马特,戈尔多尼,戈德,焦尔,焦玛恩德罗德,焦姆罗,豪伊杜多罗格,豪伊杜哈德豪兹,豪伊杜圣毛尔,豪伊杜索博斯洛,哈尔塞莱克,哈尔卡尼,哈特万,赫维什,赫维兹,伊布赖尼,伊萨塞格,伊扎克,亚诺什哈尔马,亚诺什绍莫里亚,亚萨帕蒂,亚萨罗克萨拉什,亚斯费尼萨鲁,亚斯基谢尔,卡包,卡洛恰,卡普瓦尔,卡尔察格,克采尔,克梅切,肯代雷什,克雷克艾吉哈扎,凯斯特海伊,基什拜尔,基什昆毛伊沙,基什塔尔恰,基什泰莱克,基舒伊绍拉什,基什瓦尔达,科马迪,科马罗姆,科姆洛,克尔门德,克勒什拉达尼,克塞格,科扎尔米什莱尼,昆赫杰什,昆圣马尔顿,昆圣米克洛什,拉巴特兰,拉尤什米热,伦蒂,莱陶韦尔泰什,莱特涅,洛林齐,马格洛德,马考,曼多克,马尔察利,马尔通瓦沙尔,马泰绍尔卡,梅伊库特,梅佐贝伦伊,梅佐查特,梅佐黑杰什,梅佐克雷什泰什,梅佐科韦什德,梅佐图尔,明森特,莫哈奇,莫诺尔,默尔,莫罗哈洛姆,瑙杜德瓦尔,瑙吉阿陶德,瑙吉厄切德,瑙吉哈拉斯,瑙吉卡洛,瑙吉克勒什,瑙吉马罗斯,涅克拉达哈扎,涅尔盖舒伊法卢,尼尔巴托尔,尼尔马达,尼尔特莱克,奥查,奥尔克尼,奥罗斯拉尼,帕克什,帕农哈尔马,帕斯托,佩切尔,佩奇瓦拉德,皮利什沃勒什瓦尔,波尔加,波尔加尔迪,波马兹,普什波克拉达尼,普斯塔萨博尔奇,普特诺克,拉乔尔马什,拉茨凯韦,拉卡马兹,拉科齐法尔瓦,绍约圣彼得,山多尔法尔瓦,沙尔博高尔德,沙尔卡德,沙罗什保陶克,绍尔瓦尔,绍陶尔尧乌伊海伊,希克洛什,希蒙托尔尼亚,绍尔特瓦德凯尔特,舒梅格,萨巴德萨拉什,萨尔瓦什,萨兹哈尔隆巴塔,塞切尼,塞格哈洛姆,圣戈特哈德,圣洛林茨,塞伦奇,锡盖特哈洛姆,锡盖特瓦尔,锡克瑟,塔布,塔马希,塔皮奥瑟莱,塔波尔察,泰格拉什,泰特,蒂萨福尔德瓦尔,蒂萨菲赖德,蒂萨凯奇凯,蒂萨洛克,蒂绍乌伊瓦罗斯,蒂萨瓦什瓦里,托考伊,托考尔,通帕,托罗克巴林特,托罗克圣米克洛什,托特科姆洛什,图拉,图尔凯韦,乌伊基焦什,乌伊绍斯,沃莫什佩尔奇,瓦尔帕洛塔,瓦沙罗斯纳门伊,瓦什瓦尔,魏切什,维赖谢吉哈扎,维尔佩莱特,维斯托,扎霍尼,扎拉圣格罗特,齐尔茨,占贝克"},

      {name: "土耳其 Turkish", i: 16, min: 2, max: 10, d: "", m: 0,
        b: "耶尔卡亚,布尤鲁卡亚,埃尔登特佩,阿拉克森,巴哈尔贝伊利,博兹巴伊,卡拉奥克鲁,阿尔通贝伊,亚尔卡莱,亚尔库特,阿卡尔代雷,阿尔泰布尔努,埃森特佩,奥克贝伦,德林苏,阿拉奥巴,亚曼贝伊利,艾科尔,埃金欧瓦,萨兹特佩,巴哈尔卡莱,代夫雷克迪比,阿尔普塞基,奥尔曼塞基,埃尔卡莱,亚尔贝伦,艾泰,亚曼亚卡,阿尔泰代伦,埃森,耶迪耶利,阿尔普科尔,德米尔科尔,耶迪约尔,埃尔登卡亚,亚伊布尔努,加尼勒,巴亚特尤尔特,科普兹特克,艾特佩,德尼兹,阿扬,阿亚兹代雷,特佩,凯拉,艾亚卡,代伦,阿达特佩,卡尔坎埃利,博兹卡莱,耶迪代伦,科贾约鲁,萨兹代雷,博兹凯森,奥古泽利,亚伊拉迪比,乌卢约尔,阿尔泰,艾瓦尔,阿拉亚卡,亚洛巴,苏亚卡,巴尔塔贝里,波伊拉兹代伦,埃伊米尔,耶迪尤瓦,库尔特,耶尔特佩,奥克塔尔,卡拉奥克,埃金贝里,埃尔尤尔杜,埃伦,埃伦勒,瑟尔,奥古兹,阿赛,博佐克埃利,艾库特,奥尔曼约尔,亚兹卡亚,卡尔坎欧瓦,亚兹贝伊利,多库兹特克,比尔盖,埃尔滕苏尤,科普兹尤瓦,布尤鲁克库特,阿卡尔迪肯,艾巴雷,阿斯兰贝伊利,阿尔通凯纳克,阿提克奥巴斯,亚伊拉埃利,科尔特佩,萨卢雷利,科尔卡亚,艾巴贝里,凯梅雷夫,亚纳雷,贝伊迪勒利,布尤鲁克奥巴,约尔杜曼,腾格里特佩,多库兹苏,乌尊科尔,埃尔登尤尔杜,凯梅尔,科尔特克,博佐克埃夫,博佐巴,奥尔曼卡莱,阿斯卡莱,奥古兹托普拉克,约尔贝里,库姆塞基,埃森奥巴斯,图尔克贝伦,阿亚兹塞基,杰雷内利,塔伊库特,拜拉姆代伦,贝伊迪亚卡,博兹特佩,乌卢奥巴,耶尔亚卡,乌尔加迪肯,埃森苏,巴伊卡莱,杰雷恩科尔,博兹约尔,杜兰奥巴,阿拉杜曼,代尼兹利,巴哈尔,亚尔克森,多库兹尔,亚曼卡亚,科贾塔尔拉,阿拉亚卡,托普拉克埃利,萨尔普塔尔拉,萨尔普科伊,瑟尔凯纳克,阿达亚卡,阿亚兹凯纳克,科普兹,图尔克,卡尔特,库姆,埃尔滕,布尤鲁克,耶尔,阿达,阿拉佐瓦,艾瓦尔杜曼,布尤鲁克奥克,艾瓦尔托普拉克,乌尊特佩,宾塞基,耶迪贝伊,杜兰卡莱,阿拉兹托普拉克,萨尔普奥克,亚帕罗巴斯,亚伊特佩,阿斯贝里,卡尔坎科尔,贝伊迪尔特佩,阿达贝里,比尔盖尤鲁,加尼尤尔特,阿尔坎特克,埃森勒勒,阿斯贝伊,埃尔登卡莱,埃伦凯纳克,奥古兹科尤,阿亚兹奥巴,博伊努兹托普拉克,奥科瓦,亚洛克鲁,锡夫里贝里,尤拉迪肯,萨兹贝伊,卡拉凯纳克,科普兹科尤,布尤鲁卡伊,科贾卡亚,特佩杜曼,亚纳尔塞基,阿提克尤尔特,埃森埃夫,阿卡尔贝伊利,亚伊特克,代夫雷克松古尔,阿克塞基,拜库特,卡尔坎代雷,乌尔加罗瓦,代夫雷克埃夫,尤拉贝伊,巴亚特埃夫,亚兹苏,武拉雷利,锡夫里贝伊利,阿拉欧瓦,阿尔普奥巴斯,亚尔尤尔特,埃尔马托普拉克,阿拉兹凯纳克,埃森艾,埃尔滕埃夫,萨卢尔科尔,埃金奥克,亚尔贝伊,耶尔代雷,加尼贝伊,阿尔泰库特,巴尔塔博伊,埃雷利,艾瓦尔苏,乌尊萨兹,巴伊埃利,埃伦尤尔,科贾贝伊,代林塔伊,阿亚兹约尔,阿斯兰奥巴,埃森凯纳克,埃金利克,阿尔普尤鲁,阿拉云特,博泽斯基,埃尔基尔,杜兰苏尤,尤拉克,库特,多杜尔加,库特卢贝伊,库特鲁尤尔特,博伊努兹,阿拉尤尔,艾巴尔,阿斯兰埃利,凯梅尔塞基,巴尔塔苏尤,阿卡尔尔,艾瓦尔布尔努,博伊努兹贝伊利,阿达松古尔,埃森科尔,亚曼奥巴,托普拉克科尔,乌尊尤尔特,松古尔,博佐克,凯梅尔利,阿拉兹,德米尔奇,卡尔特佩"},

      {name: "柏柏尔 Berber", i: 17, min: 2, max: 10, d: "s", m: .2,
        b: "阿卜胡奇,阿德拉尔,阿赖什,阿夫拉格,阿加迪尔,阿盖尔马姆,阿格马特,阿格拉卡尔,阿古尔马姆,阿哈加尔,阿伊特巴哈,阿吉迪尔,阿卡,阿尔穆,阿梅格杜勒,阿米兹米兹,阿姆克纳斯,阿姆利勒,阿穆拉库什,安法,安纳巴,阿乌贾,阿尔巴特,阿尔富德,阿尔古布,阿里夫,阿斯菲,阿斯夫鲁,阿绍文,阿萨梅尔,阿斯夫,阿乌鲁兹,阿伊特梅莱尔,阿扎加尔,阿齐拉,阿齐拉勒,阿兹穆尔,阿兹罗,阿兹鲁,贝卡尔,贝贾,本努尔,本斯利曼,贝尔坎,贝雷希德,比塞尔特,布贾埃德,布阿亚什,布德尼卜,布夫拉,布斯库拉,布特费尔达,达尔阿卢什,达尔布阿扎,达尔查巴内,德奇拉,代姆纳特,登登,杰贝勒,杰代达,德拉尔瓜,埃尔胡西马,索维拉,艾扎赫拉,法斯,夫尼代克,盖泽兹,古贝拉特,格里萨芬,盖尔米姆,盖尔西夫,哈马迈特,哈鲁达,赫迪法,胡塞马,霍瓦拉,伊丹,伊杜拉尔,伊芬达森,伊福加斯,伊夫兰,伊格胡德,伊克比尔,伊米尔希尔,伊姆祖伦,伊内兹甘,伊尔赫姆,伊祖哈尔,詹杜拜,卡塞姆,凯利比亚,肯尼特拉,克兰多,哈利迪亚,赫米瑟特,赫尼夫拉,胡里卜加,霍里卜加,基达尔,科尔巴,科尔布斯,拉赫劳因,拉腊什,莱云,勒克利亚,马努巴,马蒂尔,马扎甘,姆彻尔加,姆迪克,梅格林,梅拉勒,梅卢勒,米代勒特,米苏尔,穆罕默迪亚,穆尔纳格,姆里尔特,纳布勒,纳杜尔,纳祖尔,努瓦克肖特,内夫扎,瓦尔扎扎特,瓦赞,瓦尔赞,乌艾兹宰姆,乌季达,乌拉德泰马,克森蒂纳,拉德斯,拉夫拉夫,萨菲,塞夫鲁,塞吉内,塞塔特,锡吉勒马萨,斯希拉特,斯利曼,索马,斯拉格纳,苏萨,塔巴尔卡,塔德拉特,塔费尔卡,塔菲拉勒特,塔夫劳特,塔夫扎,塔格巴卢特,塔格尔代特,塔格祖特,塔凯尔萨,塔利乌因,坦贾,坦坦,陶里尔特,塔尔吉斯特,塔鲁丹特,塔鲁丹特,塔斯费拉莱特,塔索特,塔塔,塔蒂温,陶纳特,塔扎,塔扎古尔特,塔泽尔卡,塔齐扎乌特,塔兹纳赫特,特布尔巴,特布尔苏克,特马拉,泰斯图尔,得土安,提贝斯克特,蒂费尔特,提吉迪特,提纳里温,廷杜夫,廷贾,提塔万,提兹尼特,图布卡尔,特里波利,图布卡勒,突尼斯,乌尔塔西拉,乌鲁普,瓦古滕,瓦尔尔尼,瓦尔扎扎特,瓦特拉斯,瓦赫兰,瓦杰达,哈米达,叶德尔,尤素菲亚,扎古安,扎赫雷特,泽穆尔,兹里巴"},

      {name: "阿拉伯 Arabic", i: 18, min: 2, max: 9, d: "ae", m: .2,
        b: "阿卜哈,阿治曼,阿拉巴尔,阿拉尔贾姆,阿拉什拉夫,阿拉瓦利,阿尔巴瓦迪,阿尔比尔克,阿尔达比亚,阿尔杜韦德,阿尔法里克,阿尔盖耶德,阿尔哈齐姆,阿尔赫拉泰姆,阿尔胡代达,阿尔胡韦亚,阿尔贾赫拉,阿尔朱拜尔,阿尔哈法,阿尔哈拉斯,阿尔哈瓦尼季,阿尔肯,阿尔霍巴尔,阿尔胡兹纳,阿利萨法,阿尔穆沙伊赫,阿尔穆尔詹,阿尔穆瓦伊赫,阿尔穆扎伊利夫,阿尔纳希姆,阿尔纳西法,阿尔卡赫,阿尔库兹,阿尔库拉亚特,阿尔拉达,阿尔拉克米亚,阿尔萨迪亚,阿尔萨法,阿尔沙加布,阿尔舒凯克,阿尔西拉,阿尔萨菲尔,阿马克,阿姆兰,阿尔纳塞姆,阿克比亚,阿拉法特,阿尔阿尔,阿尔达,阿斯凡,阿沙伊拉,阿斯卡尔,阿亚尔,阿齐兹亚,巴艾什,巴赫拉,巴尔哈夫,巴尼扎伊德,比迪亚,比沙,比亚塔,布盖克,布赖代,达菲亚特,达马德,达曼,达里耶,扎法尔,宰赫兰,宰尔库特,祖尔马,迪巴卜,多哈,杜汉,杜瓦伊巴,埃纳克尔,法德拉,法海尔,法纳提尔,法拉桑,法尔达,富查伊拉,加利拉,加尔,吉兹兰,贡吉亚,格兰,哈迪亚,哈法,哈詹巴,哈吉拉,哈卡克,哈拉德,哈萨尔,哈维亚,赫巴,赫法尔,希贾尔,胡斯纳,胡韦拉特,胡韦塔,伊尔卡,伊沙拉,伊特拉,贾马拉,贾拉卜,贾里夫,贾赞,吉达,吉布拉,吉哈纳,吉拉,吉赞,祖赖巴,朱班,朱美拉,卡马兰,凯亚德,卡布,海伊巴尔,卡萨布,卡西拉,哈瓦拉,胡莱斯,库姆扎尔,利马,利纳,马德拉克,马哈卜,马哈拉,马赫塔尔,马什瓦尔,马西拉,马斯利亚,马斯塔巴,马扎尔,麦地那,米卡特,米尔巴,穆赫塔拉,穆哈拉格,穆拉达,穆萨伊卡,穆沙伊里夫,穆斯拉,穆萨法,纳夫汗,纳季兰,纳卡卜,尼兹瓦,阿曼,卡达,卡尔哈特,卡姆拉,卡萨姆,科斯马,库赖因,库里亚特,库尔瓦,拉达,拉法,拉赫拉,拉卡玛,拉希达,拉斯马德拉卡,里萨巴,鲁斯塔克,利雅得,萨卜塔尔贾拉,萨达,萨菲纳,萨哈姆,塞哈特,萨拉拉,萨尔米亚,沙布瓦,沙里姆,沙克拉,沙"},

      {name: "因纽特 Inuit", i: 19, min: 2, max: 15, d: "alutsn", m: 0,
        b: "阿卢伊克,阿皮拉特托克,阿西亚特,阿吉萨特,阿格萨萨特,阿库利亚鲁西普,阿库纳阿克,阿鲁伊楚普,阿鲁托克,阿米特索尔苏阿克,阿马萨利克,阿纳鲁苏克,昂古尼阿尔塔菲克,安内图索克,安尼基索克,阿帕尔苏伊特,阿普西亚阿吉克,阿尔西维克,阿尔苏克,阿塔米克,阿特卡纳克,阿蒂里苏阿克,阿图,奥格帕卢格托克,奥卡尔涅尔苏阿克,奥玛特,奥维尔基卡瓦苏普,阿瓦德特莱克,阿瓦勒苏阿克,比约内斯克,布拉贝尔达伦,布隆斯特达伦,布拉特尔希德,布雷德布雷,布雷德达尔,克劳斯港,埃德德弗勒戈尔,埃格,埃卡卢加林努伊特,埃卡卢加苏伊特,埃卡鲁伊特,埃夸,埃塔,格拉赫,哈克鲁伊特,哈雷达伦,哈雷岛,胡恩德奥,伊加利库,伊格德洛尔苏伊特,伊格德卢阿尔苏克,伊金尼亚菲克,伊卡米乌特,伊卡里萨特,伊卡泰克,伊克尔米乌特,伊克尔莫伊苏阿克,伊科尔法苏伊特,伊利马纳克,伊洛尔苏伊特,伊卢努伊特,伊鲁伊莱克,伊卢利萨特,伊马尔斯维克,伊马尔图纳尔苏克,伊姆克奥尔图卡吉克,因纳尔苏伊特,因内鲁拉利克,因努苏利苏阿克,伊佩拉克,伊皮克,伊克,伊索尔托克,伊苏恩加尔图索克,伊蒂莱克,伊蒂萨阿利克,伊蒂夫德勒克,伊蒂特,伊托科尔托尔米特,伊维格米乌特,伊维图特,卡纳尤拉尔图乌特,康阿米乌特,康格克,康格尔鲁克,康格鲁苏阿克,康格林努伊特,卡皮西利特,克克塔米乌特,基亚塔克,基亚塔乌萨克,基加塔克,基瑙萨克,金吉托尔苏阿克,基塔克,基齐苏阿苏伊特,基齐苏特,克伦茨纳,库克,克劳尔斯港,库贾勒克,库洛尔苏阿克,库鲁苏克,库尔米特,库苏阿克,拉克瑟达伦,马尼伊措克,马拉卡吉克,马塔安加苏特,梅尔诺克,米蒂瓦卡特,莫里乌萨克,米格布克塔,纳贾阿特,南吉萨特,纳努乌塞克,纳帕索克,纳萨尔米伊特,纳萨苏阿克,纳尔萨克,纳西菲克,纳齐亚尔苏菲克,瑙贾努伊特,尼亚科尔纳尔苏克,尼亚科尔纳特,北峡湾通道,努加齐亚克,努纳尔苏伊特,努纳尔苏阿克,努纳塔阿克,努纳塔卡瓦苏普,努塔阿尔米乌特,努加阿齐亚克,努克,努克库拉克,奥隆金比延,奥达阿克,奥卡特苏特,奥卡伊苏图努伊特,奥科尼米乌特,帕阿古萨特,帕阿米乌特,帕阿图乌特,帕卢恩加塔克,帕米亚鲁克,佩尔瑟拉约克,皮图菲克,普乌古塔,普乌尔库伊普,卡阿纳克,卡阿苏伊苏普,卡埃苏特,卡亚尔塔利克,卡鲁纳阿特,卡夸托克,卡西吉安努伊特,卡西米乌特,克尔塔尔塔瓦克,克克塔克,克克塔苏苏克,克尔克塔塔,克尔纳托克,克尔纳图努伊特,卡亚纳雷克,金阿格萨特,夸努鲁普,夸鲁尔托苏阿克,夸利科苏伊特,夸讷里特,夸图德勒克,拉夫讷达伦,里滕本克,瑞普达伦,萨阿洛克,萨阿托尔苏阿克,萨阿图图,萨利亚鲁塞克,萨梅卡克,萨米索克,萨宁阿苏克,萨卡克,萨卡尔勒苏阿克,萨卡尔利特,萨尔方圭阿克,萨蒂阿阿特特克,萨维西维克,瑟尔方圭阿克,瑟尔梅尔苏克,瑟尔米利加阿克,瑟尔米利克,瑟尔米特西亚克,西米塔卡加,西米乌塔克,辛加马克,西奥拉帕卢克,西西米乌特,西苏阿苏伊特,苏洛尔苏阿克,苏尼卡吉克,斯韦德鲁普,塔阿托克,塔基塞克,塔西利阿克,塔西乌萨克,蒂勒里拉阿克,蒂米勒尔苏阿,蒂米阿尔米乌特,图金阿苏克,图萨阿克,图图利苏苏普,图乌尤克,乌伊瓦克,乌伊洛尔图索克,乌尤阿卡吉普,乌库西萨特,乌佩尔纳维克,乌托尔修蒂特,乌乌曼纳克,乌乌纳尔托克,乌夫库西萨特,伊梅尔"},

      {name: "巴斯克 Basque", i: 20, min: 2, max: 11, d: "r", m: .1,
        b: "阿古赖因,阿伊亚,阿亚拉,阿尔比兹图尔,阿尔基萨,阿尔察加,阿莫雷比埃塔,阿穆里奥,安多因,阿诺埃塔,安苏奥拉,阿拉卡尔多,阿兰察苏,阿尔巴特塞吉,阿雷亚察,阿拉特苏阿,阿列塔,阿尔特亚,阿尔钦涅加,阿斯特阿苏,阿斯蒂加拉加,阿陶恩,阿乔多,奥莱斯蒂,阿兹科伊蒂亚,阿兹佩伊蒂亚,巴基奥,巴利阿赖因,巴拉卡尔多,巴里卡,巴伦迪亚,巴绍里,贝阿萨因,贝迪亚,贝伊萨马,贝劳恩扎,贝拉斯特吉,贝尔加拉,贝尔梅奥,贝尔内多,贝尔里亚图阿,贝里兹,比达尼亚,比拉尔,毕尔巴鄂,布斯图里亚,德巴,德里奥,多诺斯蒂亚,杜兰茨,杜兰戈,埃阿,埃瓦尔,埃兰乔贝,埃尔杜因,埃尔格塔,埃尔戈伊蒂亚,埃尔穆阿,埃伦特里亚,埃雷齐尔,埃斯科里亚察,埃斯库埃尔纳加,埃切瓦里,埃切巴里亚,埃斯基奥,福鲁阿,加比里亚,甘查,加尔达卡奥,加米斯,加拉伊,加斯特伊兹,加特萨加,高贝亚,高特吉兹,加斯特卢,根尼卡,格里凯塔兹,盖塔里亚,盖乔,基萨布鲁阿加,高伊亚茨,戈尔利兹,戈里阿加,哈拉纳,赫尔南尼,洪达里比亚,伊巴拉,伊巴兰杰卢,伊迪亚扎巴尔,伊科拉,伊戈雷,伊卡兹特吉耶塔,依伦,伊鲁拉,伊鲁赖斯,伊察索,伊察松多,伊乌雷塔,伊祖尔察,亚塔贝,坎佩苏,卡兰萨,科尔特祖比,克里潘,夸尔坦戈,拉内斯托萨,兰奇耶戈,拉拉贝特祖,拉萨特,劳基兹,拉斯卡奥,莱亚布鲁,莱加斯皮,莱戈雷塔,莱古蒂奥,莱因茨,莱奥阿,莱凯伊蒂奥,莱莫阿,莱莫伊斯,莱萨,莱扎马,莱佐,利萨尔察,马埃斯图,马拉比亚,马纳里亚,马尔基纳,马鲁里,梅纳卡,门达罗,门达塔,门德萨,莫尔加,蒙达卡,蒙吉亚,穆尼蒂巴尔,穆鲁埃塔,穆斯基斯,穆蒂洛阿,穆特里库,纳巴尼兹,奥伊阿尔祖恩,奥伊翁,奥孔多,奥拉贝里亚,奥纳蒂,翁达罗阿,奥尔迪西亚,奥伦丹,奥雷萨,奥里亚,奥里奥,奥尔迈兹特吉,奥罗斯科,奥尔图埃拉,奥特吉,奥查迪奥,帕萨伊亚,普伦齐亚,桑图尔齐,塞斯塔奥,桑迪卡,索拉卢塞,苏卡里耶塔,托洛萨,特拉帕加兰,图尔齐奥斯,乌巴伦迪亚,乌比德,乌高,乌尔杜阿,乌尔杜利斯,乌里扎哈拉,乌尔卡布斯泰斯,乌尔涅塔,乌雷乔,乌苏尔比尔,谢梅因,萨瓦莱塔,扎亚,萨尔迪瓦,萨布拉纳,萨穆迪奥,萨拉塔莫,萨劳兹,泽贝里奥,泽加马,泽赖因,泽斯托阿,泽尔贝纳,齐戈蒂亚,齐奥尔察,祖伊阿,祖马亚,祖马拉加"},

      {name: "尼日利亚 Nigerian", i: 21, min: 2, max: 10, d: "", m: .3,
        b: "阿巴多戈,阿巴丰,阿德阿莱苏,阿德托,阿迪永戈,阿法加,阿法姆朱,阿吉格比吉,阿戈戈克,阿胡特,艾耶拉博罗,阿杰贝,阿乔拉,阿卡雷库,阿库努巴,阿拉沃德,阿尔凯伊吉,阿曼甘,阿姆拜耶,阿姆塔萨,阿穆尼贡,阿尼马洪,阿尼约科,阿拉帕吉,阿桑德,奥格巴格巴,阿伍姆,阿沃杜,巴巴特杜瓦,班达夸伊,邦迪,比利卡尼,比尔宁多多,布赖杜,布拉卡瓦,布里布里,该南,查库姆,钟杜格,达瓜尔加,达尔皮,多卡托法,多泽雷,埃贝利布里,埃费姆,埃科库,埃克佩,埃乌霍维里,加利亚,加门,甘金,甘特图杜,加尔加,加林博德,格布雷,格蒂,吉丹,吉塔巴雷穆,吉亚吉里,吉亚瓦,格马瓦,戈拉科奇,戈伦巴,军吉,瓜姆布拉,瓜多蒂,哈因莱雷,哈因迈阿莱瓦,希里希,洪博,伊贝富姆,伊贝雷科多,伊查尔杰,伊多芬,伊多芬奥卡,伊戈博戈,伊乔科,伊朱瓦,伊考加,伊欣,伊帕基多特,伊克佩奥尼翁,伊穆奥戈,伊帕沃,伊平莱雷雷,伊西查,伊塔克帕,詹吉,贾雷,贾塔乌达库姆,贾乌罗贡基,杰佩尔,卡芬马拉马,卡塔布,卡坦加,卡廷达,卡提里杰,考拉金巴,克芬沙努,克鲁米里,基阿博多,基尔布图,基塔,科戈戈,科普杰,科罗科罗斯,科托库,夸塔,库朱姆,库考,昆布恩,库努博格本,库拉韦,库希纳胡,夸拉马凯里,拉迪梅吉,拉菲亚罗,拉哈加,莱因德巴贾恩勒,莱因德戈罗,拉卡蒂,利滕斯瓦,马巴,马达尔扎伊,马伊阿尼塔,马利坎萨,马塔,梅戈约,梅库,米阿马,莫迪,姆希,姆苏格,穆杜武,穆尔纳切胡,南奈,恩达曼马,恩迪乌伦贝,恩多努廷,恩戈班德,恩圭恩古,恩托埃克佩,尼亚乔,尼约尔,奥达杰,奥格巴加,奥古尔图,奥贡本米,奥乔波德,奥克辛,奥卢贡纳,奥莫通德,奥尼佩德,奥恩玛,奥赫雷,奥利亚,奥图夸恩,奥图纳德,伦帕,里米,鲁干,鲁姆布卡瓦,萨比乌,桑加巴马,萨拉贝,塞博雷盖托雷,沙法尔,沙瓜,沙塔,申古,索科隆,苏纳尤,塔福基,塔库拉,塔隆坦,塔赫姆巴,塔尤,特尔,蒂姆蒂姆,蒂姆亚姆,廷迪尔克,托昆博,托尔卢瓦姆,采阿卡阿扎,采阿农戈,采贝维,采帕埃格,图巴,图姆博,通加隆博,通加尼亚克维,乌基里希,乌莫鲁,乌穆阿拜,乌穆阿朱朱,翁奇达,翁瓜,翁瓜尔,翁翁戈,乌沙,乌通博,维姆贝拉,乌罗,亚恩巴希,亚恩梅迪,约库,扎伦克瓦里,齐卢莫,祖利卡"},

      {name: "凯尔特 Celtic", i: 22, min: 2, max: 12, d: "nld", m: 0,
        b: "阿伯拉曼,阿伯朗格尔,阿伯阿尔特,阿伯阿冯,阿伯班克,阿伯巴尔戈埃德,阿伯比格,阿伯卡奈德,阿伯卡恩,阿伯卡斯尔,阿伯塞吉尔,阿伯克拉夫,阿伯克雷甘,阿伯西赫,阿伯锡农,阿伯代尔,阿伯达伦,阿伯道格莱道,阿伯丁,阿伯杜莱斯,阿伯迪菲,阿伯雷德,阿伯雷迪,阿伯雷尔克,阿伯朗,阿伯范,阿伯夫劳,阿伯弗鲁德,阿伯加文尼,阿伯格莱,阿伯格拉斯林,阿伯戈尔莱赫,阿伯瓜恩,阿伯格韦辛,阿伯格威利,阿伯格温菲,阿伯格温格雷金,阿伯吉诺尔温,阿伯哈弗斯普,阿伯洪杜,阿伯肯菲格,阿伯莱芬尼,阿伯梅因,阿伯毛,阿伯莫尔杜,阿伯穆尔,阿伯南特,阿伯彭纳,阿伯波特,阿伯里乌,阿伯索赫,阿伯西查恩,阿伯塔威,阿伯泰菲,阿伯辛,阿伯蒂利里,阿伯特里杜尔,阿伯里斯特威斯,阿奇宁弗,阿冯哈弗伦,阿利萨哈,安福萨德,安廷比赫阿莫尔,阿登纳,阿塔孔,班温,贝拉,布鲁拉,布雷德法,博伊奥杜罗,博纳,博斯金,博斯洛文波尔布罗格,布杜布里加,布拉冯,布里甘特,布里甘塔,布里瓦,布罗斯纳奇,凯尔斯乌斯,坎博杜努姆,坎布拉,卡拉克塔,卡图马戈斯,森托布里加,塞雷迪金,查兰,凯尔巴林,克拉赛,科尔迈克,库伊兰纳赫,丁恩,迪瓦,杜宾根,杜比迪格,杜罗,埃博拉,埃布鲁阿克,埃布罗杜努姆,埃克莱斯,埃格洛斯库里,埃格,埃雷安,费尔库诺斯,弗莱斯宁,加尔布瓦勒,热纽阿,格兰尼斯,格威尔斯,赫尔特西斯,赫布伦,霍尔德,因比尔,因比尔艾尔,因内莱森,因内利文,因内威克,因弗,因弗阿尔迪,因弗阿兰,因弗阿尔蒙德,因弗阿姆萨伊,因弗安,因弗阿雷,因弗阿尔南,因弗贝尔维,因弗克莱德,因弗埃尔,因弗艾斯克,因弗法里盖,因弗加里,因弗戈登,因弗高里,因弗哈登,因弗凯洛尔,因弗凯西,因弗凯斯尼,因弗基普,因弗雷,因弗莱特,因弗洛赫,因弗洛赫拉里格,因弗洛奇,因弗梅,因弗莫里斯顿,因弗内斯,因弗奥兰,因弗申,因弗斯奈德,因弗特罗萨克斯,因弗乌吉,因弗乌格拉斯,因弗乌里,尤布拉奇,卡拉尔德,基尔宁弗,柯克卡尔迪,柯克因蒂洛赫,克拉克,兰格罗,拉滕斯,莱明,林多马戈斯,兰纳贝,兰迪迪威格,兰迪尔诺格,兰法尔辛,兰加达瓦尔德,兰桑维尔,洛奇宁弗,卢格杜诺,马戈杜罗,迈赫拉,蒙茅斯郡,南希里亚斯,纳兰,诺维奥杜诺,诺维约纳戈,奥克托杜伦,彭宁,佩奥法兰,蓬斯穆尔,雷辛,里科马戈,罗斯因弗,萨洛杜鲁姆,塞古伊亚,森蒂卡,瑟尔萨,托巴尔盖尔,特雷劳,特雷费斯戈布,特雷韦登内克,特雷维瑟兰,图艾斯凯尔特,乌伊吉,维托杜鲁姆,温多博纳"},

      {name: "美索不达米亚 Mesopotamian", i: 23, min: 2, max: 9, d: "srpl", m: .1,
        b: "阿达布,亚当顿,阿德玛,阿德马图姆,阿格拉布,阿卡德,阿克沙克,阿姆纳努姆,安达里格,安善,阿皮鲁,阿普姆,阿兰图,阿尔比德,阿尔帕奇亚,阿尔帕德,阿拉法,阿什拉卡,亚述,阿万,巴比伦,巴德-提比拉,巴拉瓦特,巴尔西普,比尔图,比特-布纳基,波西帕,楚埃拉,达什拉,德尔,迪尔巴特,迪尼克图姆,杜拉,杜尔-库里加尔祖,杜尔-沙鲁金,杜尔-温塔什,杜尔-古尔古尔里,埃卜拉,埃卡拉图姆,埃卡尔特,埃玛尔,埃尔比勒,埃雷什,埃里都,埃什努,埃什努那,加尔加米什,加苏尔,高拉,吉比尔,吉尔苏,吉扎,哈比伦,哈布尔,哈达图,哈库兰,哈拉布,哈拉比特,哈马齐,哈穆卡尔,哈拉杜姆,哈尔比杜姆,哈兰,哈拉努,哈苏纳,哈塔里卡,哈特拉,希萨尔,希亚瓦,霍米尔扎德,伊达-马拉斯,伊达马拉兹,伊杜,伊梅里舒,伊姆古尔-恩利尔,伊里萨格里格,伊尔尼纳,伊尔里杜,伊辛,伊辛尼图姆,伊图鲁恩加尔,伊祖比图姆,贾尔莫,杰姆代特,卡布纳克,卡迦什,卡哈特,卡尔胡,卡尔-舒尔马努-阿沙雷杜,卡尔-图库尔提-尼努尔塔,卡兰,卡拉特佩,卡图库尔提,卡扎卢,凯什,基德沙,金扎,基什,基西加,基苏拉,夸拉,库尔达,库鲁汉尼,库塔,拉加巴,拉加什,拉拉克,拉尔萨,莱兰,马尔吉乌姆,马拉德,马达曼,玛里,马尔利克,马什坎,马什坎-沙皮尔,马图特姆,美-图兰,梅利杜,穆姆巴卡特,纳巴达,纳加尔,纳纳古加尔,内雷布图姆,尼金,尼姆鲁德,尼纳,尼尼微,尼努亚,尼普尔,尼鲁,尼亚,努哈舍,努齐,普兹里什-达甘,卡拉特贾尔莫,卡塔拉,卡特纳,卡图南,基德舒,拉皮库姆,劳达,萨加兹,沙杜普姆,沙加拉图姆,沙尔巴图,沙尼达尔,沙鲁金,沙万,谢赫纳,谢姆沙拉,希巴尼巴,舒巴特-恩利尔,舒尔库提尔,舒鲁帕克,舒沙拉,舒辛,锡坎,锡帕尔,锡帕尔-阿姆纳努姆,锡帕尔-沙-安努尼图姆,苏巴图姆,苏苏卡,塔德莫尔,塔尔比苏,特鲁尔,特尔卡,提拉齐什,提斯本,图巴,图什汉,图图尔,图图布,乌拜德,乌玛,乌尔,乌拉赫,乌尔比鲁姆,乌尔克什,乌尔萨乌姆,乌鲁克,乌鲁姆,乌扎尔鲁鲁,瓦尔卡,瓦舒坎尼,扎巴拉姆,扎里-阿姆纳"},

      {name: "伊朗 Iranian", i: 24, min: 2, max: 11, d: "", m: .1,
        b: "阿巴里,阿布里沙姆,阿布萨尔德,阿布泽伊达巴德,阿夫斯,阿拉维切,阿利科什,阿莫尔,阿纳拉克,安巴尔,安迪谢,安善,阿兰,阿尔达比勒,阿尔德里卡,阿尔代斯坦,阿尔乔曼德,阿斯加兰,阿斯加拉巴德,阿希安,阿万,巴巴詹,巴德鲁德,巴夫兰,巴赫斯坦,巴赫沙德,巴哈多兰,巴哈兰沙赫尔,巴哈雷斯坦,巴昆,巴姆,巴盖尔沙赫尔,巴尔佐克,巴斯塔姆,贝希斯顿,比蒂斯塔,布马亨,布什尔,查代甘,查哈尔丹盖,昌加尔丹,彻尔马欣,乔加博努特,乔根,达马内,达马万德,达拉布加尔德,达兰,达斯特盖尔德,德哈克,德哈坎,代兹富尔,迪齐切,多尔切,道拉特阿巴德,杜伦塔什,埃克巴塔那,伊斯兰沙赫尔,埃斯塔赫尔,埃兹希耶,法拉瓦尔詹,法罗希,法沙姆,费尔多西亚,费雷敦沙赫尔,费伦阿巴德,费鲁兹库赫,富拉德沙赫尔,甘杰达雷,甘扎克,加兹,格奥伊,戈丁,戈尔达什特,戈列斯坦,戈尔帕耶甘,戈尔沙赫尔,戈尔尚,戈尔加布,古格德,哈比巴巴德,哈夫谢詹,哈吉费鲁兹,哈纳,哈兰德,哈桑阿巴德,哈桑鲁,哈什特盖尔德,赫卡通皮洛斯,霍米尔扎德,伊曼沙赫尔,伊斯法罕,詹达克,贾瓦达巴德,吉罗夫特,乔什甘,乔兹丹,卡布纳克,卡赫里扎克,卡赫里兹桑格,坎加瓦尔,卡拉季,卡尔克万德,卡尚,凯利沙德,克尔曼沙赫,哈利达巴德,汗萨尔,霍拉马巴德,库尔,霍尔祖克,基兰,科梅,科梅什切,科纳尔,库哈耶,库尔,库什克,拉瓦桑,莱比德,利安,利扬,马哈巴德,马哈拉特,马杰莱西,马拉德,曼扎里耶,马尔利克,梅什卡特,梅梅,米安达什特,米什,莫巴拉克,纳哈万德,奈因,纳贾法巴德,纳克舍,纳雷扎什,纳西姆沙赫尔,纳西尔沙赫尔,纳斯拉巴德,纳坦兹,尼亚萨尔,尼卡巴德,尼姆瓦尔,努沙巴德,帕克达什特,帕兰德,帕尔迪斯,帕尔萨,帕萨尔加达伊,帕提格拉巴纳,皮尔巴克兰,皮什瓦,卡赫德里詹,卡赫贾韦雷斯坦,卡姆萨尔,卡尔恰克,古兹,拉巴特,雷-沙赫尔,里兹万沙赫尔,拉格斯,罗巴特卡里姆,罗兹韦,鲁德亨,萨巴沙赫尔,萨法达什特,萨格兹,萨莱赫耶,桑达尔,萨尔维斯坦,塞代,塞菲德沙赫尔,塞米罗姆,塞姆南,沙德普拉巴德,沙赫,沙赫达德,沙赫德沙赫尔,沙辛,沙赫普尔,沙赫雷扎,沙赫里亚尔,沙里法巴德,谢姆沙克,设拉子,舒山,舒什塔尔,锡阿尔克,辛,苏赫特,塔巴斯,大不里士,塔赫特,塔尔昆切,塔利,塔尔克,特穆坎,泰佩,提兰,图德什克,图伦,乌尔米耶,瓦希迪耶,瓦尔卡纳,瓦纳克,瓦拉明,瓦尔南卡斯特,瓦尔扎内,瓦兹万,叶海亚,亚里姆,亚苏季,扎林沙赫尔,扎瓦雷,扎延代,扎泽兰,齐亚尔,齐巴沙赫尔,兹兰卡"},

      {name: "夏威夷 Hawaiian", i: 25, min: 2, max: 10, d: "auo", m: 1,
        b: "阿胡阿卡伊奥,阿胡帕乌,阿霍阿,阿拉阿库阿,阿拉埃洛阿,阿拉米希,阿莱,阿勒阿迈,阿勒纳,阿里奥,阿普埃奥,奥波科波科,奥洛埃瓦,奥洛瓦鲁,奥马奥皮奥,奥瑙,奥诺乌利,奥帕纳,奥帕乌拉,奥皮库拉,波奥波奥,波波努伊,波哈卡内莱,波拉波拉,波拉努伊,波拉伊基,波乌波乌韦拉,哈拉卡阿,哈雷乌,哈利伊迈莱,哈莫阿,哈纳卡奥奥,哈纳瓦纳,哈纳乌鲁,哈内霍伊,哈欧,胡埃洛,霍奥拉瓦,霍库乌拉,火奴鲁鲁,霍诺波乌,霍诺卡胡阿,霍诺凯阿纳,霍诺科豪,霍诺马埃莱,霍诺纳纳,霍诺希纳,基科奥,基帕帕,卡阿拉埃阿,卡阿帕胡,卡埃奥,卡奥诺乌鲁,卡波胡埃,卡哈莱希利,卡哈纳,卡胡艾,卡卡拉哈雷,卡卡诺尼,卡莱奥艾赫,卡莱纳努伊,卡利阿利努伊,卡利玛奥赫,卡利希,卡洛伊,卡马尼,卡梅哈梅,卡纳赫纳,卡尼奥乌拉,卡帕洛阿,卡普艾基尼,卡普纳克阿,卡瓦洛阿,卡乌阿乌,卡乌拉洛,卡乌拉纳莫阿,卡乌鲁奥哈纳,卡乌玛卡尼,卡乌马努,卡乌瑙哈内,卡乌帕库卢阿,凯阿阿,凯阿胡阿,凯阿胡阿波诺,凯阿拉霍乌,凯阿奈,凯阿乌拉,凯奥凯阿,凯奥普卡,凯奥乌霍乌,凯卢阿,凯内赫,科阿库普纳,科阿利,克劳埃阿,科洛科洛,科皮利,科乌,库阿拉帕,库霍阿,库霍利利阿,库科艾,库科希阿,库库伊阿埃奥,库库伊普卡,库库伊乌拉,库拉胡胡,库希瓦,库伊阿,库伊库伊,拉帕克阿,拉普埃奥,劳纽波科,洛雷,马阿洛,马卡阿基尼,马卡阿莱,马卡埃胡,马卡利乌阿,马卡皮皮,马卡普乌,马卡伊瓦,马鲁阿卡,马纳瓦伊努伊,马希纳希纳,迈哈梅努伊,迈莱帕伊,莫阿利伊,莫阿努伊,莫奥洛阿,莫奥穆库,莫奥伊基,莫霍皮利,莫卡埃,莫库帕帕,莫库伊阿,穆奥雷阿,纳卡阿哈,纳卡奥胡,纳卡勒波,纳卡佩胡,纳库拉,纳皮利,尼尼奥,努乌,帕阿凯阿,帕埃阿胡,帕埃奥希,帕埃哈拉,帕霍阿,帕卡基阿,帕莱莫,帕劳埃阿,帕尼奥,帕帕阿埃阿,帕帕阿努伊,帕帕阿乌哈乌,帕帕卡,帕帕乌鲁阿纳,帕乌库,帕乌瑙,帕乌瓦鲁,帕乌韦拉,帕伊阿,普阿霍奥瓦利,普阿凯阿,普阿科,普阿拉埃阿,普埃奥卡乌伊基,普埃胡埃胡,普奥卢阿,普卡阿胡胡,普库伊卢阿,普勒胡,普欧乌,普乌奥迈莱,普乌哈埃哈埃,普乌基,普乌拉尼,普乌瑙,普乌伊基,瓦希库利,瓦伊阿纳埃,瓦伊阿努,瓦伊阿瓦,瓦伊埃胡,瓦伊埃利,瓦伊奥胡利,瓦伊奥霍勒,瓦伊奥霍努,瓦伊奥基拉,瓦伊奥卡玛,瓦伊奥派,瓦伊奥普阿,瓦伊卡普,瓦伊拉莫阿,瓦伊劳劳,瓦伊尼伊,瓦伊帕奥,瓦伊皮奥努伊,瓦伊普乌利,乌阿奥阿,乌哈奥,乌库梅哈梅,乌莱诺,乌鲁马鲁,希基亚乌佩阿"},

      {name: "卡纳塔克 Karnataka", i: 26, min: 2, max: 11, d: "tnl", m: 0,
        b: "阿迪蒂亚帕特纳,阿迪亚尔,阿尔卡尔古德,阿尔纳瓦尔,阿尔西克雷,阿夫扎尔普尔,阿兰德,阿卢尔,阿尼卡尔,阿特尼,安比卡纳加拉,安科拉,安尼盖里,奥拉德,巴达米,巴达瓦蒂,巴尔基,巴格帕利,巴加尔科特,巴杰佩,巴萨瓦卡利安,巴萨瓦纳,巴特卡尔,巴亚德吉,拜尔,班加拉佩特,班加罗尔,班卡普拉,班努尔,班特瓦尔,贝尔高姆,贝尔坦加迪,贝卢尔,比达尔,比尔吉,比贾布尔,比鲁尔,比马拉亚纳古迪,博马桑德拉,查拉克雷,查马拉贾纳加尔,达尔加约吉哈利,丹代利,德瓦杜尔加,德瓦纳哈利,多德,多尼马莱,甘加瓦蒂,冈德卢佩特,高里比达努尔,戈卡克,戈尼科帕尔,古比,古迪班达,古尔伯加,古尔马特卡尔,古莱古达,哈蒂,哈拉帕纳哈利,哈里哈尔,哈利亚尔,哈桑,哈韦里,汉加尔,汗纳普尔,赫巴戈迪,赫加达代万科特,胡布利,胡克里,霍尔,霍拉尔凯雷,霍姆纳巴德,霍纳利,霍纳瓦尔,霍萨科特,霍萨纳加拉,霍斯杜尔加,霍斯佩特,霍维纳,加达格,贾加卢尔,贾姆坎迪,加詹德拉加尔,杰瓦尔吉,卡迪根哈利,卡杜尔,卡尔哈特吉,卡尔卡尔,卡尔瓦尔,卡马拉普拉姆,卡纳卡普拉,坎普利,科迪亚尔,科拉尔,科拉塔盖雷,科勒加尔,克里希纳拉贾纳加拉,克里希纳拉贾萨加拉,克里希纳拉杰佩特,科努尔,科帕,科帕尔,科特图鲁,库德雷穆克,库德利吉,库德奇,库尔贡塔,库姆塔,库沙尔纳加尔,库什塔吉,昆达戈尔,昆达普拉,昆敦德,昆尼加尔,昆苏尔,拉布卡维,拉克什梅什瓦尔,拉马纳加拉姆,拉姆杜尔格,拉尼本努尔,拉伊丘尔,雷巴格,林苏古尔,隆达,伦,罗伯森,马迪凯里,马杜尔,马杜吉里,马哈林普尔,马拉尔,马拉瓦利,马卢尔,迈索尔,曼迪亚,曼维,芒加罗尔,莫拉卡尔穆鲁,穆达尔吉,穆达尔吉,穆德比德里,穆德比哈尔,穆德霍尔,穆德加尔,穆迪盖雷,穆尔巴加尔,穆尔德戈德,穆尔贡德,穆尔基,穆卢尔,穆尼拉巴德,纳尔贡德,那伽曼加拉,纳拉西马拉贾普拉,纳雷加尔,纳瓦尔贡德,南詹古德,尼帕尼,帕瓦加达,潘达瓦普拉,皮里亚帕特纳,普杜,普图尔,奇克,奇科迪,奇克马加卢尔,奇克纳亚坎哈利,奇塔普尔,奇特戈帕,奇特拉杜尔加,钱纳吉里,钱纳拉亚帕特纳,钱纳帕特纳,乔格,钦乔利,钦塔马尼,萨达尔吉,萨加尔,萨克莱什普尔,萨利格拉姆,萨瓦努尔,塞达姆,桑杜尔,桑克什瓦尔,沙哈巴德,沙克提纳加尔,沙普尔,绍恩达蒂,施里兰加帕特纳,斯里尼瓦斯普尔,斯林格里,苏利亚,索拉布,索姆瓦佩特,塔里凯雷,塔利科塔,特尔达尔,特卡拉科特,提尔塔哈利,提鲁马库达尔,提普图尔,图鲁韦凯雷,图姆布,图木库尔,瓦迪,维贾亚普拉,乌杜皮,锡达普尔,锡德拉加塔,希尔哈蒂,锡尔西,希戈昂,希卡普尔,锡拉,锡拉尔科帕,希雷凯鲁尔,锡鲁古帕,希罗普尔,辛德努尔,辛迪吉,亚德吉尔,叶尔巴尔加,叶拉普尔,叶兰杜尔,叶纳古德,伊尔卡尔,因迪"},

      {name: "克丘亚 Quechua", i: 27, min: 2, max: 12, d: "l", m: 0,
        b: "阿蒂科,阿尔帕瓦伊科,阿雷基帕,阿普里马克,阿塔瓦尔帕,阿塔瓦尔帕,阿亚胡安科,阿亚库乔,阿伊鲁,安克亚,安奇怀,奥克沙帕尔卡,奥龙科伊,奥罗卡瓦,奥扬塔伊坦博,奥约洛,查尔瓦马约,查克拉,查克拉拉胡,查姆帕拉,昌昌,哈顿,哈瓦科查,哈伊卡,哈伊瓦里斯卡,汉皮克,胡利,吉里尚卡,卡尔佩,卡尔瓦卡塔克,卡尔瓦克,卡尔瓦克,卡哈马卡,卡卡南蓬塔,卡拉波,卡马斯卡,卡纳伊雷,卡萨马尔卡,卡尚,卡瓦克,卡瓦斯诺,卡乌拉拉胡,卡耶什,卡伊卡,坎查坎查,考赛,科查莫科,科胡普,科卡帕塔,科拉纳,科里怀拉奇纳,科里怀拉奇纳,科里莫科,科洛塔,科诺科查,科帕约克,科恰班巴,科图普奎奥,库埃拉普,库乔克塞拉,库斯库,库斯恰卡,库亚,奎尔卡伊万卡,奎利亚,奎努阿拉克拉,奎什克,奎塔拉胡,奎塔拉克萨,拉胡科尔塔,拉胡塔卡南,拉胡图纳,拉克塔帕塔,拉里亚,拉萨克,兰科查约克,兰拉帕尔卡,兰拉希尔卡,朗加努科,里奥班巴,里马里马,鲁雷克,鲁里科查,卢帕查约克,伦库拉卡伊,洛克拉斯卡,马尔库,马丘,马塔拉胡,梅切克,米胡伊,米鲁阿科查,莫罗丘科,穆奈,帕查卡马克,帕查卡马克,帕查库蒂,帕查库特克,帕查拉胡,帕查玛玛,帕尔卡拉胡,帕尔卡斯,帕哈滕,帕卡里纳,帕卡马约,帕卡伊卡萨,帕科,帕拉普,帕里亚,帕纳卡,帕塔拉克塔,帕塔瓦西,帕提班巴,帕伊蒂蒂,潘帕,蓬戈斯,皮萨克,皮斯科,普卡科尔帕,普卡兰拉,普卡希尔卡,普马坦博,普斯坎图尔帕,普塔卡,普尤帕塔马卡,奇利瓦,切基阿克拉胡,钦乔,琴切伊,琼皮卡尔基,琼塔赫,丘库伊托,丘奎阿波,丘奎萨卡,丘鲁普,丘洛,丘姆皮,丘帕瓦乔,丘伊托,萨克萨,萨克萨马尔卡,萨拉波,赛里帕塔,赛瓦,赛亚克马尔卡,松科帕,塔里帕伊帕查,泰坦奇斯,陶利拉胡,陶万廷苏尤,提瓦纳库,通贝斯,图尔帕拉胡,图科,图库班巴,托克拉拉胡,瓦多伊,瓦尔查卡,瓦尔坎,瓦卡,瓦卡鲁阿斯,瓦卡维尔卡,瓦鲁纳拉胡,瓦马什拉胡,瓦曼加,瓦乔,瓦钦加,瓦萨卡兰,瓦伊拉,瓦伊拉纳,瓦伊拉斯,瓦伊利班巴,瓦伊塔拉,维查扬卡,维尔卡班巴,维奈瓦伊纳,维尼奥奇,乌尔塔,乌里瓦纳,乌鲁阿什拉胡,乌丘拉卡伊,乌丘拉卡伊,西纳卡拉,雅查伊,雅克塔,雅克塔,亚纳库查,亚纳马雷伊,亚内沙,亚瓦拉胡,耶鲁帕哈,伊基查,伊利亚斯卡,伊辛卡,因蒂蓬库,查查蓬塔,朱劳"},

      {name: "斯瓦西里 Swahili", i: 28, min: 2, max: 9, d: "", m: 0,
        b: "阿比姆,阿莱布通,阿鲁阿,阿鲁沙,阿莫拉塔尔,阿穆鲁,阿帕克,阿朱马尼,埃尔多雷特,埃雷古,埃马利,昂戈拉,奥亚姆,巴巴蒂,巴拉戈伊,邦博,本迪布焦,布达卡,布根贝,布贡马,布吉里,布凯德阿,布科巴,布科曼辛比,布昆古,布利萨,布森巴提亚,布申伊,布索尔韦,布塔莱贾,布坦巴拉,布特雷,布文盖,布西亚,布延代,布伊克韦,达达阿布,蒂卡,多多马,多科洛,恩布,恩德贝,恩杰鲁,恩科孔杰鲁,恩琼贝,恩通加莫,格代,古卢,汉德尼,霍拉,霍伊马,基安布,基奥特拉,基巴哈,基巴勒,基宾戈,基布韦齐,基戈马,基利菲,基里扬东戈,基鲁胡拉,基苏木,基索罗,基塔莱,基特古姆,基图伊,基西,基希希,基延乔乔,基耶格瓦,加里萨,金贾,卡阿邦,卡布沃赫,卡布扬达,卡基里,卡加迪,卡贾多,卡金加,卡库马,卡兰加拉,卡利罗,卡隆戈,卡隆古,卡农古,卡普乔瓦,卡塞塞,卡苏卢,卡塔奎,卡永加,凯罗卡,坎帕拉,坎温格,科博科,科蒂多,科罗格韦,库米,拉凯,拉穆,朗加塔,利安东德,林迪,卢加济,卢卡亚,鲁昆吉里,卢瓦哈卡哈,卢韦罗,鲁维米,卢文戈,鲁伊鲁,伦迪亚尼,洛德瓦尔,洛基乔吉奥,洛阳加拉尼,马查科斯,马芬加,马金杜,马坎巴科,马拉巴,马林迪,马纳夫瓦,马萨比特,马萨卡,马苏利塔,马图加,马辛迪,马尤格,曼德拉,梅鲁,蒙巴萨,米蒂亚纳,米托玛,莫罗戈罗,莫罗托,莫亚莱,莫约,姆巴拉拉,姆巴莱,姆贝亚,姆本德,穆科诺,穆兰加,姆潘达,姆蓬德韦,姆皮吉,穆索马,姆特瓦拉,穆图库拉,穆托莫,姆万扎,那贡盖拉,纳卡皮里皮里特,纳卡塞克,纳卡松戈拉,纳库鲁,纳罗克,纳罗莫鲁,纳马英戈,纳曼加,纳穆通巴,奈瓦沙,南萨纳,南尤基,内比,内罗毕,尼亚胡鲁鲁,尼耶里,帕德尔,帕奎奇,帕利萨,帕伊达,乔赞加,萨巴加博,桑给巴尔,桑加,森巴布雷,什尼扬加,松巴万加,松格阿,索罗蒂,塔博拉,塔康古,坦噶,通杜马,托罗罗,瓦吉尔,瓦基索,瓦塔穆,韦伯耶,维希加,温达尼,沃布伦兹,沃特,沃伊,西龙科,希马,希莫尼,辛吉达,伊班达,伊甘加,伊林加,伊西奥洛,伊辛吉罗,云贝"},

      {name: "越南 Vietnamese", i: 29, min: 2, max: 12, d: "", m: 1,
        b: "阿允巴,安定,安江,安沛,安清,安仁,安水,安溪,巴地,巴地-头顿,巴墩,巴属,邦湖,邦美蜀,宝禄,北𣴓,北江,北宁,北𤅶,笔橙,笔桥,波来古,蔡来,大北,大叻,德勒,德普,奠边,奠边府,奠洲,东潮,洞海,东河,都良,峨眉,峨南,峨山,富安,富美,富宁,富强,富寿,甘帕,甘水,甘溪,甘蔗,高峰,高岭,高平,广安,广南,广宁,广平,广顺,广祥,广义,广治,海防,海阳,河华,河静,河南,河内,河内,和平,和盛,河中,红岭,红汝,后江,胡志明,黄梅,会安,嘉莱,嘉来,嘉义,建祥,金贝,金瓯,荆门,𡐓罗,奎凤,奎和,奎仁,奎周,昆光,昆嵩,莱州,岚桃,浪静,老街,乐山,乐水,黎纪,利智,谅山,良山,隆安,隆美,隆庆,隆仙,吕黄,芒街,芒勒,美豪,美萩,枚州,南定,南坛,宁和,宁平,农功,潘郎-塔占,潘切,平定,平福,平龙,平明,平顺,平阳,普安,契山,契英,芹苴,庆和,清化,清漳,如春,如清,三唅,三歧,山罗,山西,少化,石城,顺安,顺化,朔庄,松功,松求,太和,太平,太原,头顿,托敦,五功,西宁,下龙,岘港,香茶,香水,新安,新乐,新奇,新孙,新洲,兴安,兴元,宣光,芽庄,沿海,义安,义路,义禄,义山,义坛,英山,永安,永茶,永福,永隆,永禄,裕进,玉勒,至灵,朱笔二,朱笔三,朱笔一,朱笃,𠄩安,𡓜槃"},

      // {name: "Cantonese", i: 30, min: 5, max: 11, d: "", m: 0, b: "Chaiwan,Chingchung,Chinghoi,Chingsen,Chingshing,Chiunam,Chiuon,Chiuyeung,Chiyuen,Choihung,Chuehoi,Chuiman,Chungfu,Chungsan,Chunguktsuen,Dakhing,Daopo,Daumun,Dingwu,Dinpak,Donggun,Dongyuen,Duenchau,Fachau,Fanling,Fatgong,Fatshan,Fotan,Fuktien,Fumun,Funggong,Funghoi,Fungshun,Fungtei,Gamtin,Gochau,Goming,Gonghoi,Gongshing,Goyiu,Hanghau,Hangmei,Hengon,Heungchau,Heunggong,Heungkiu,Hingning,Hohfuktong,Hoichue,Hoifung,Hoiping,Hokong,Hokshan,Hoyuen,Hunghom,Hungshuikiu,Jiuling,Kamsheung,Kamwan,Kaulongtong,Keilun,Kinon,Kinsang,Kityeung,Kongmun,Kukgong,Kwaifong,Kwaihing,Kwongchau,Kwongling,Kwongming,Kwuntong,Laichikok,Laiking,Laiwan,Lamtei,Lamtin,Leitung,Leungking,Limkong,Linping,Linshan,Loding,Lokcheong,Lokfu,Longchuen,Longgong,Longmun,Longping,Longwa,Longwu,Lowu,Luichau,Lukfung,Lukho,Lungmun,Macheung,Maliushui,Maonshan,Mauming,Maunam,Meifoo,Mingkum,Mogong,Mongkok,Muichau,Muigong,Muiyuen,Naiwai,Namcheong,Namhoi,Namhong,Namsha,Nganwai,Ngautaukok,Ngchuen,Ngwa,Onting,Pakwun,Paotoishan,Pingshan,Pingyuen,Poklo,Pongon,Poning,Potau,Puito,Punyue,Saiwanho,Saiyingpun,Samshing,Samshui,Samtsen,Samyuenlei,Sanfung,Sanhing,Sanhui,Sanwai,Seiwui,Shamshuipo,Shanmei,Shantau,Shauking,Shekmun,Shekpai,Sheungshui,Shingkui,Shiuhing,Shundak,Shunyi,Shupinwai,Simshing,Siuhei,Siuhong,Siukwan,Siulun,Suikai,Taihing,Taikoo,Taipo,Taishuihang,Taiwai,Taiwohau,Tinhau,Tinshuiwai,Tiukengleng,Toishan,Tongfong,Tonglowan,Tsakyoochung,Tsamgong,Tsangshing,Tseungkwano,Tsimshatsui,Tsinggong,Tsingshantsuen,Tsingwun,Tsingyi,Tsingyuen,Tsiuchau,Tsuenshekshan,Tsuenwan,Tuenmun,Tungchung,Waichap,Waichau,Waidong,Wailoi,Waishing,Waiyeung,Wanchai,Wanfau,Wanshing,Wingon,Wongpo,Wongtaisin,Woping,Wukaisha,Yano,Yaumatei,Yautong,Yenfa,Yeungchun,Yeungdong,Yeungsai,Yeungshan,Yimtin,Yingdak,Yiuping,Yongshing,Yongyuen,Yuenlong,Yuenshing,Yuetsau,Yuknam,Yunping"},

      {name: "蒙古 Mongolian", i: 31, min: 2, max: 12, d: "aou", m: .3,
        b: "阿达查格,阿尔布拉格,阿尔泰,阿尔坦措格茨,阿尔坦希热,阿拉格额尔登,艾拉格,巴特诺罗夫,巴特萨干,巴特森格勒,巴特希热特,巴彦阿达尔嘎,巴彦阿格特,巴彦敖包,巴彦布拉格,巴彦查干,巴彦达赖,巴彦敦,巴彦戈壁,巴彦洪戈尔,巴彦呼塔格,巴彦力格,巴彦蒙赫,巴彦努尔,巴彦努尔,巴彦苏尔赫,巴彦塔勒,巴彦图门,巴彦温都尔,巴彦乌尔,巴彦扎尔嘎兰,比格尔,宾德尔,博尔温都尔,博格德,博木博戈尔,布尔干,布尔赫,布嘎特,布仁托克托赫,布日汗盖,布乌查干,布彦特,察德木尼,察德木尼温都尔,察干敖包,察干德勒格尔,察干诺尔,察干乌尔,察希尔,车车勒格,车次格,车恩赫,车恩赫曼达勒,车尔,楚鲁恩霍罗特,楚鲁特,措格特,措格特敖包,措格特策希,达达尔,达尔汗,达尔汗木明干,达尔维,达兰扎德嘎德,达兰扎尔嘎兰,达希巴尔巴尔,达欣其楞,德勒格尔,德勒格尔汗,德勒格尔汗盖,德勒格尔赫,德勒温,德仁,都特,多尔贡,额尔德尼,额尔德尼布尔干,额尔德尼布仁,额尔德尼达赖,额尔德尼曼达勒,额尔德尼特索格特,鄂尔多斯,鄂尔贡,鄂尔浑,鄂给,鄂木诺德勒格尔,嘎鲁乌特,盖尔沙尔,盖尔特,戈壁乌格塔尔,古尔万,古尔万布拉格,古尔万赛汗,古尔万扎嘎勒,哈尔汗,哈勒戈尔,哈力温,哈沙特,哈坦布拉格,哈特嘎勒,汗博格德,汗盖,汗哈尔,汗赫,汗洪戈尔,赫尔伦,赫希格温都尔,洪戈尔,呼尔门,呼勒德,呼林郭勒,呼伦贝尔,呼热,呼热马拉勒,呼塔格温都尔,霍冬,霍赫,霍伦贝尔,霍通特,科布多,科布苏古尔,拉沙安特,卢乌斯,绿诺尔,马塔德,曼达赫,曼达勒敖包,曼汗,曼莱,蒙赫哈尔汗,明嘎德,莫戈德,末伦,末斯特,诺罗夫林,诺木贡,诺永,乔巴山,仁钦勒昆布,萨格赛,赛尔格楞,赛汗,赛汗敖包,赛汗杜兰,赛音查干,赛音山达,色布日,色楞格,森布尔,沙尔嘎,沙林郭勒,塔里亚兰,塔里亚特,泰希尔,特希格,通赫勒,图布什鲁勒赫,图默德,吐内尔,托尔布,托格勒格,托格托赫,托木尔布拉格,托松森格勒,温都尔汗,温都尔乌兰,温都尔希勒,翁纽德,乌兰巴德拉赫,乌兰察布,乌兰哈德,乌兰库斯,乌兰乌尔,乌力吉,乌日特,乌英奇,希维戈壁,新额德尔,新金斯特,兴安,耶逊布拉格,伊赫赫特,伊赫塔米尔,伊赫乌尔,赞敏乌德,泽热格,札尔嘎尔特汗,札尔嘎兰,札尔嘎朗特,扎格,扎莱努尔,札鲁德,镇斯特"},

      // fantasy bases by Dopu:
      {name: "人类 Human Generic", i: 32, min: 2, max: 11, d: "peolst", m: 0,
        b: "白岸,白谷,白骨口,边港,冰堡,冰光,不朽冠,不朽前线,草原,尘盾,尘十字,尘守望,城堡十字,池瀑,池镇,纯壳,春望,春沼,脆盔,盗贼港,冬港,洞沼,陡荒泽,渡鸦边,恶魔瀑,风暴角,风暴之手,疯村,疯狂美,弗雷壳,干宿,高源,狗草地,狗海岸,古湖,古门,光谷,海洋星,寒堡,寒霜湾,黑守望,湖交,琥珀谷,荒卫,灰哨所,寂堡,疾关,疾钟,箭巢,金裂口,金院,荆盔,静厅,荆院,荆冢,旧墙,旧守望,旧域,惧峰,巨龙堡,巨龙裂,巨龙卫,巨石,恐怖巢,恐怖谷,狼关,黎明林,黎明水,猎犬堡,猎犬呼,烈焰井,烈焰卫,露谷,鹿寒,露湖,绿古,蛮井,蛮伊甸,蛮院,美堡,玫瑰谷,玫瑰生,玫瑰域,蒙德关,蜜水,磨坊滩,末湖,末星,木材边,幕岩,南裂,泥渡,泥镇,黏土山,牛光,牛溪,盆地荒原,平林,平崖,平镇,漆黑前线,汽口,汽墙,骑士潮,骑士光,强力谷,峭堡,桥林,桥瀑布,青柠带,青铜掌,清卫,秋堡,秋带,沙丘,山关,闪林,闪流,商村,蛇湖,神话断,神话峡,深冢,失落盾,失落星,失落冢,石卫,石咒,霜盆地,水晶尖塔,水晶岩,死堡,死渡,松池,苔藓潮,苔藓风,苔藓之手,天鹅墙,天鹅卫,天使之手,铁洞,铁冢,土关,土口,土门,土田,伪谷,雾窖,污郡,污林,乌鸦窖,乌鸦林,西草地,潟湖关,西岬,橡木奔,橡木钟,小堡,小厅,小沼,小沼,心渡,心窖,新瀑,心坠,雄鹿港,熊卫,熊沼,锈荒原,虚空风暴,雪盾,雪湾,雪镇,迅井,崖断,崖盾,崖门,盐峰,盐口,阳厅,阳湾,妖精池,妖精谷,妖精院,夜厅,荫草地,荫林,银峡,荫镇,银冢,鹰脉,永岸,永寒,幽暗燃,幽灵峰,幽灵谷,余烬窖,月井,月亩,月湾,云冠,云林,云湾,沼巨口,珍珠港,中堡,钟港,钟域,钟冢,灼哨所,灼摊,诅咒卫,诅咒原,诅咒咒"},

      {name: "精灵 Elven", i: 33, min: 2, max: 12, d: "lenmsrg", m: 0,
        b: "阿德林德斯特,阿尔玛连,阿弗兰瑟马,阿拉里,阿拉纳尔,阿拉萨丽,阿莉然,阿莉亚娜萨丽,阿莉耶洛娜,阿伦,阿洛拉,阿玛尔,阿什梅贝尔,艾安娜,艾贝尔,埃德海尔,埃尔德-辛诺克林,艾芙兰,艾弗兰露玛,艾奎亚,艾兰纳林,艾兰萨玛,艾兰塔雷斯,艾蕾尔希尔,埃利亚尔贡德,艾鲁诺瑞,艾伦娜,艾洛森索,埃米兰瑟琳,艾姆露梅,埃萨里,埃萨斯,埃塞里乌斯,艾瑟尔,艾斯萨林,埃斯塔拉斯,艾塔西,艾希尔,安因德尔,奥阿伦诺拉,奥贝斯,奥尔鲁,奥尔马伦,奥尔曼,奥法伊塔提尔,奥鲁恩,奥洛米纳斯,奥什纳,奥什瓦梅尔,贝尔-迪德海尔,布林诺里昂,德莱瑟,德兰赞,德劳高斯特,多拉里斯,多隆德,恩西斯,法梅伦诺拉,法伊伦诺尔,菲尔兰连,菲尔萨奎亚,冈多温,古阿鲁,海尔萨德,海洛里亚斯,海斯,汉露娜,霍露尔泰,霍露海伊,霍鲁斯,霍依瑞尼尔,贾阿尔,加费塞斯,加夫瑟林,贾姆卡迪,杰利恩,卡阿鲁梅,卡安塞拉,卡兰萨尼尔,卡诺西亚,卡瑟蒂尔,凯阿特伦诺尔,凯尔西娅,凯哈瑟拉,凯洛拉,凯瑟艾奎亚,凯瑟海斯,科洛恩,拉赫泰斯,拉乌格阿尔,勒尔哈美尔,勒福多瑞,利蒂斯,利尔哈瑞恩,利法,利莲,利娜塔拉斯,林迪恩尼尔,林多雷斯,洛高海,马切伊,马赛诺里斯,马森特斯,马泰提尔,米斯伦德,米斯瑟美尔,米斯塔斯,米塔,米特拉斯,纳奥霍纳,纳德阿尔,纳德丁迪尔,纳德隆,纳洛尔,纳萨德伊劳斯,纳斯,纳特玛尔,内尔阿伦,尼昂安德,尼尔姆,尼尔纳塔伊斯,尼勒那提尔,尼伦,尼萨塔诺尔,尼特那纳斯,乔安德拉,切乌尔萨德,瑞安那塞拉,瑞玛塞林,瑞瑟拉,瑞斯伦诺拉,瑞塔海伊,萨诺尔,赛尔玛露玛,赛赫梅尔,赛拉纳诺尔,赛兰格,赛勒里恩,赛勒诺斯,赛勒泽德拉津,赛玛那斯,赛那提斯,赛瑞安德,赛瑞提尔,赛瑟露娜,瓦尔西安,瓦鲁美尔,瓦斯瑞恩,威尔-沙尼多尔,维尔阿戈尔,韦纳斯,乌尔美特海斯,乌尔森,乌尔维,乌拉尔,乌米瑟林,乌姆纳林,乌姆耶,乌纳里斯,乌那内斯,乌纳瑞斯,乌纳斯,希尔阿伦,希尔达雷,希尔哈梅尔,希尔霍尔,希尔玛尔,希尔梅特,希尔那艾诺,希尔娜雷,希尔那诺尔,希尔瑟塔洛斯,希尔塔,希尔塔洛斯,希尔特拉斯,希尔托瑞恩,希雷尔,希里那斯,希蒙萨,希蒙瑟林,希姆拉连,希姆利恩,希那诺尔,希内阿德,希欧萨丽,亚伦,亚纳尔里恩,叶尔鲁梅,叶提瑞恩,伊奥玛斯,伊尔霍罗娜,伊瑞塔罗斯,伊沙尔,伊什拉沙拉,伊泰利昂,伊特林,伊乌利尔,依乌瑟琳"},

      {name: "黑暗精灵 Dark Elven", i: 34, min: 6, max: 14, d: "nrslamg", m: .2,
        b: "阿拜萨加,阿布尔斯,阿弗兰瑟玛,阿哈拉斯普利特,阿沙马努,阿什莱希亚斯,阿谢萨里,艾达纳特,埃德莱西恩,埃尔德辛诺克林,埃拉尔伊辛,埃林德林,埃洛尔松德,安德莱斯,安德劳尔斯,安德雷克托兹,安格塔尔,奥德鲁恩,巴尔莫拉,巴哈沙埃,拜拉里欧,拜雷格赫尔,拜瑟伊,贝尔迪德赫尔,博雷萨尼尔,布伊兰丁,查尔维尔劳高斯特,查加,查加乌斯特,达尔金,达斯克林格,戴德罗格,德尔达克,德莱瑟,德兰赞,德兰兹希尔,德劳高斯特,德雷尔海,德雷盖伊,德林德卢,迪永恩尼瓦尔兹,多拉德雷斯,多拉里斯,多隆德,多乌尔登,恩赫蒂尔,恩希亚斯,尔哈尔维,法拉德赫尔,法尼达尔,费尔多尔,菲尔兰林,费萨拉斯,弗尔马里昂,格拉莫迪斯,格罗恩德,戈洛萨尔,格纳尔莫克,格尼西斯,贡多尔温,古尔辛,瓜利杜尔斯,瓜鲁,哈尔加内斯,哈格莱夫,哈卡尔德拉,海斯,豪恩德劳斯,豪尔萨德,赫拉玛查尔,赫劳盖伊,赫鲁伊塔尔,赫洛里亚斯,赫洛伊雷尼尔,吉尔拉内尔,贾查尔金,贾尔,加费希亚斯,卡埃格罗斯,卡埃拉吉斯,卡埃拉萨拉,卡尔德拉斯,卡兰萨尼尔,卡隆德卡,卡索鲁希尔,凯拉布莱,凯利斯,克拉卡隆德,克洛伊布拉,科莫拉,库尔,拉赫希亚斯,莱瑟伊,劳高斯特,劳瓜尔,利杜尔斯,里劳文,利里拉肯,利斯米亚萨,林迪尼尔,卢尔斯德雷尔,路伊豪伦塔尔,洛丝,洛修艾尔,玛埃拉林,玛埃里米德拉,玛萨斯洛纳,玛瑟希尔,梅洛多纳,梅纳吉斯,梅内格温,梅内伦迪尔,门兹希尔,门佐贝兰赞,蒙多尔,米拉尼帕尔,米瑟林,米瓦纳斯,莫拉格马,纳加隆德,纳萨德伊劳斯,纳维萨斯,南德迪尔,瑙索尔,尼迪尔,尼亚达尔,努尔塔利维,诺鲁本,欧贝斯,欧尔温,欧菲纳西尔,欧拉洛纳,欧莱特拉,欧洛梅尔,佩拉吉德,齐尔纳卡尼宁,奇梅尔,钱塔尔,乔恩德拉,乔尔辛,切德纳萨德,切斯里宁,切塔尔伊斯林,萨德里斯,萨拉拉斯特,赛达宁,塞尔泽德拉辛,沙马斯,沙门兹,沙乌尔辛,沙兹里尔,山图尔,斯卡尔,斯山提尔,斯山廷兰,斯辛迪林,斯兹斯林,斯兹斯莫卡内,斯佐拜斯,特布卓尔,特尔梅尔,特尔纳克尔,特劳盖,特里泽克斯,特林德赫特,提里布林,瓦尔斯瓦,瓦贾,瓦瑟,瓦瑟伊,维尔德拉,维尔德林莎尔,维尔肖尼多尔,维洛希,维纳尔戈瑟,维尼德,沃亚,乌尔伦瑟琳,乌尔马塔洛斯,乌尔梅希亚斯,乌高斯,乌海尔本,乌海姆,乌鲁伊图尔,乌萨埃西恩,乌斯特纳萨,希尔本,西尔德姆本,希拉斯隆德,西兰格罗斯,亚卡里丹,耶卢梅,伊里德伦本,伊西劳海姆,伊扎伊欧吉斯,因费里乌斯,因斯希,玉瑟因,玉瑟因德林,扎尔基斯"},

      {name: "矮人 Dwarven", i: 35, min: 4, max: 11, d: "dk", m: 0,
        b: "阿顿达德,阿尔布尔,阿哈格扎德,阿哈兹尔,阿吉尔,阿克兹扎德,阿拉杜什,阿拉尔,阿努穆什,巴杜什恩德,巴拉格兹格,巴拉格尊德,巴拉金布,巴拉克希尔,巴拉克辛布,巴拉克兹格,巴拉蒙兹,巴拉希尔,巴拉辛布,本迪纳尔,本杜舒尔,本杜顺德,本杜索尔,比尔吉拉,比尔加巴尔,比尔加萨布,比尔加萨兹,比尔纳拉格兹,比尔努尔巴尔,比尔努尔本,比辛比兹,比扎杜姆,比扎杜什,比扎拉姆,比扎纳格,比兹拉姆,布纳拉姆,布扎拉姆,布尊达布,布尊杜什,恩达拉尔,恩杜尔,恩杜克希尔,恩杜祖尔,恩敦,恩扎尔,恩扎森,贡杜蒙兹,贡杜沙布,贡杜西兹德,古纳尔吉尔,古纳尔加斯,古纳拉,基巴拉克,基本丁,基比尔纳尔,基比扎尔,基布纳格,基布赞,吉拉,吉雷兹尔,吉卢卡斯,吉卢克尔,基兹达本,基兹杜沙布,基兹杜沙斯,基兹杜舒尔,基兹杜谢尔,加巴拉格兹,加巴拉姆,加比尔加布,加比尔加斯,加比希尔,加布纳尔,加布努尔,加布赞,加萨尔布尔,加萨拉姆,加瑟拉格兹,加瑟拉兹,加希兹杜姆,金巴达布,金巴拉格兹,金巴拉克兹,金巴拉姆,津巴鲁克斯,金比扎,金布扎尔,卡尔巴尔比尔恩,卡尔巴萨布,卡尔贝拉,卡尔比尔加布,卡尔布扎德,卡萨尔巴尔,卡森杜什,卡希拉格兹,卡希拉兹,卡西兹丁,卡辛本德,卡扎纳尔,科勒扎尔,库拉格兹格,库拉蒙兹,昆达比尔恩,昆达布兹,昆迪纳格,昆杜谢尔,纳尔贡杜姆,纳尔贡杜什,纳尔贡努尔,纳尔吉拉,纳尔加巴德,纳尔加巴尔,纳尔加萨布,纳拉,纳拉格扎,纳拉格扎尔,纳拉格兹格,纳拉克扎,纳拉克扎尔,纳拉蒙兹,纳拉扎尔,纳雷辛布,纳雷扎尔,纳雷兹格,纳鲁克萨尔,纳鲁克塞尔,努尔巴杜什,努尔巴拉姆,努尔本达布,努尔本丁,努尔本杜姆,努尔比尔纳格,努尔布纳尔,努尔布扎,努拉,努雷扎,努雷兹格,努卢卡兹,努卢库尔,努卢坤德,齐拉金布,齐拉克希尔,齐拉蒙兹,齐鲁克萨布,齐鲁克瑟尔,沙尔巴鲁克斯,沙拉金布,沙拉克扎尔,沙拉蒙兹,沙萨尔比兹,沙萨尔比兹德,沙萨扎,沙索拉,沙希拉格兹,沙西兹杜什,舒拉克尊德,舒拉蒙兹,顺迪努布,顺杜顺德,索卢卡尔布,图蒙希尔,图蒙辛布,图蒙赞,图蒙扎德,图蒙扎尔,乌尔比拉德,乌尔比拉尔,乌克萨德,乌卢尔,乌伦扎尔,乌蒙扎德,乌沙拉尔,西兹迪纳尔,西兹杜顺德,扎迪纳格,扎杜舒尔,扎哈尔巴德,扎哈尔比兹德,扎拉基布,扎拉克扎尔,扎拉蒙兹,扎鲁克塞尔,尊杜蒙兹"},

      {name: "哥布林 Goblin", i: 36, min: 4, max: 9, d: "eag", m: 0,
        b: "阿辛克斯,埃尼斯,埃斯兹,昂克,奥兹比亚德,巴格比格,比奥克维什,比亚吉尔特,布拉特里亚克,布莱布希尔,布雷沙斯,布里德维尔布,布里克斯,布鲁斯,布亚格,查尔克,德里奥德,迪尔瓦克,多布鲁因格,法尔,法格西,法克斯,费尔霍布,菲赫尔代,弗雷加尔德,弗鲁伊尔特,弗鲁伊克特,弗罗格迪尔克,弗罗伊希奥夫兹,嘎嘎布林,戈布尔达克,戈布克,戈布林,格拉姆佐夫斯,格勒尔纳克斯,格尼艾布斯,格诺克利格,赫赛,霍布加尔,霍恩克,吉甘奇,吉维齐埃基,贾谢夫塔,卡斯,卡特梅尔特,克雷科克,克里尔德,克利尔迪克,克利尔姆,克利亚布通格,克鲁尔姆,克罗伊比埃克,科斯维尔,库伊普因克斯,雷克斯,莫夫特,莫格,尼尔博格,欧姆佐伊沙伊,帕斯,派雷阿齐,普雷安格,普罗尔克赫,齐格克,奇拉格斯,奇亚夫齐亚,乔克斯,乔斯克斯,乔伊姆托伊姆,塞尔,瑟尔特,瑟雷斯克西亚,沙克西,斯莱兹特,斯雷夫斯,斯鲁尔德,斯卢克斯,斯洛夫博伊夫,斯特里扎克特,斯特罗伊尔,斯提尔赞盖,斯提欧尔克斯,斯提欧斯库尔特,斯提亚加提亚,斯图伊克瓦克特,斯瓦克西,苏尔克斯,苏尔特,苏伊尔克斯,塔克赛,特拉格利拉,特雷亚克,瓦特维尔克斯,维克兹,沃尼奥茨,乌尔布,乌尔姆,乌萨,乌提阿姆,希尔布,西欧斯,希希尔斯,亚尔西尔特,亚扎尔姆,伊布利格兹,伊尔姆,伊什,因,兹里奥科茨"},

      {name: "兽人 Orc", i: 37, min: 4, max: 8, d: "gzrcu", m: 0,
        b: "阿德格里尔-嘎,阿德戈兹,阿多格,阿尔库格佐,阿格卡德,阿格齐尔-嘎尔,阿克,阿里兹-德鲁,阿罗尔德里,阿什内德,阿兹尔德,阿兹鲁德雷克,艾格莫德,埃克-贝克康,埃克-克雷尔德鲁格,埃克-梅兹雷德,奥迪格-克罗德,奥尔多尔,奥尔库德-布尔,奥克-乌格克,奥拉德,巴格齐尔德雷,巴哈克,巴什努德,贝德格兹-格拉兹,贝赫格,比尔戈什贝尔,比克鲁尔,比科兹杜尔,博德-鲁格尼兹,博格,博格泽尔,博兹德拉,博兹格伦,博兹兹,布尔布雷德,布尔格拉格,布尔克鲁克,布拉尔-拉佐格,布拉扎德,布鲁尔-科雷,布鲁格罗兹,布鲁克-兹拉布鲁尔,布罗尔德格格,布罗尔克里尔-兹罗格,布罗尔祖格,布罗格维德,布罗格佐齐尔,查兹-查拉德,楚嘎,楚扎尔,达尔格隆-莫格,达佐恩-内尔,德赫扎,德里兹德德,德鲁尔库兹,德鲁克-乔德戈兹,德罗巴格,德罗德-阿什努格,德罗格瓦克-德罗德,迪尔德鲁德,迪格扎格基赫,杜杜德,杜尔-卡多尔,杜尔巴佐尔,多德-布雷尔德罗德,多德-吉金,多德杜德,多德卡克,多尔格里,多贡-博格,弗恩-嘎古克,弗卡迪赫,弗拉辛,弗鲁尔古,弗鲁格-纳尔德雷尔,弗罗布伦,嘎格-德鲁兹雷德,嘎格罗克罗兹,嘎雷德-克林,盖德格罗布罗尔,盖格格尔,戈-乌格努德,戈尔加德,格尔克拉德,戈尔孔,格格诺德,戈克格默德,格拉兹-库尔嘎格,格里布拉布罗克,格里德科格,格里尔克鲁恩-库尔,格里赫-卡格兹,格鲁尔罗,格鲁格霍克,古尔-霍格卡格,古格-佐兹格罗德,吉德-乌奇格,基多尔佐格,基尔戈尔,基尔佐德,基卡德-查尔,吉兹吉尔,基佐德卡克,加兹德拉克-弗拉尔德,卡尔布鲁格,卡尔基兹,卡尔科尔-兹里德,卡克鲁兹,卡什纳格,卡兹兹-兹拉尔,科布恩,科尔布里克,科尔克里尔-格拉尔,科格戈德,克拉尔-祖尔默德,克拉吉尔德,克里赫-布尔丁,克鲁德-霍格佐克,克罗达德,克祖尔-布鲁兹,库德格罗克克,库德鲁克,库德扎尔,库尔德雷拉,库兹德拉兹,库兹格鲁德-德德,拉鲁德,拉鲁德,莱格维克罗德,雷拉德格里,雷泽格,雷兹格鲁赫,鲁迪尔格拉德,鲁尔古兹-维格,卢尔科雷,卢格克,鲁兹格林,罗德雷克,罗尔德鲁什诺克,洛尔格兰,罗格-奇尔扎兹,罗兹泽兹,马兹加尔,梅尔克拉兹,莫德-奥多德,莫尔布拉兹,莫库尔德雷尔,穆布罗尔,穆尔马德,穆加克-奇尔,穆库格-古兹,纳扎德-卢德,内尔佐-兹罗兹,内格维德,尼尔德鲁克,努布德,努德-库尔德拉,努卡格,努泽克罗,诺格沃尔卡尔,齐格莫布雷德,切甘-凯德,瓦多格,瓦戈尔德-科德,维尔格鲁德,维尔鲁格,乌尔德鲁克-布德,乌尔戈尔,乌尔金,乌格-弗鲁龙,乌格乌达德,乌姆格-埃克,乌扎格尔,乌兹德里博兹,乌兹德罗兹,乌兹隆,乌佐德,伊巴格-乔尔,伊布尔-布拉德,伊布鲁兹德,伊尔德雷尔祖格,伊尔梅克-博尔,伊格古尔扎兹,伊克-乌格南,扎尔布雷兹,扎克拉德,兹拉德-克罗多格,兹拉德古克,兹拉尔德罗兹兹,兹拉格里兹格拉克,兹拉格穆克,兹拉兹兹-瓦兹,兹里古德,兹鲁尔布克-德克,祖博德-乌尔,祖恩-贝尔格罗德,祖尔布里兹,佐尔德罗尔杜德,佐鲁德"},

      {name: "巨人 Giant", i: 38, min: 5, max: 10, d: "kdtng", m: 0, b: "阿顿德,阿加内,阿兰格里姆,阿努穆什,埃尔登德,埃拉达姆,埃拉德赫尔姆,艾罗拉,埃努兹,奥尔加,巴霍格,巴拉格尊德,巴拉金布,巴拉克辛布,巴拉克兹格,巴拉蒙兹,巴拉辛布,贝奥内尔德,贝拉提拉,本杜顺德,博格贝尔特,博萨里克,布尔图格,布雷尔斯廷,布雷姆罗尔,布里尔东,布罗祖,查兹鲁克,达尔纳里克,达格多尔,丹库克,德布奇,德拉德,德鲁古克,蒂格基兹,迪鲁,迪纳,迪内兹,杜尔昆,杜格法斯特,杜哈尔,恩杜克希尔,芬温,弗罗斯索恩,嘎卡克,戈尔克格,戈尔索,格里莫尔,格里姆提拉,格鲁,格鲁姆瓦特,格鲁斯马克,戈姆鲁克,戈斯图兹,贡杜沙布,古德吉兹,古杜德,古尔卡勒,古尔沃,古里尔,古鲁格,古纳尔加斯,古兹,哈尔加斯,哈尔特雷欧,海姆法拉,基巴拉克,基比扎尔,基尔冯德,基尔坎,吉尔昆,基吉内,吉拉,吉雷兹尔,基兹达本,基兹杜谢尔,加巴拉格兹,加巴拉姆,加比希尔,加布赞,贾尔多尔,加尔法尔德,加尔格里姆,贾尔瓦,加塔尔,加辛,金巴达布,金布扎尔,卡尔巴尔比尔恩,卡尔托克,卡克克,卡萨尔巴尔,卡希拉格兹,卡西兹丁,卡扎纳尔,凯格克兹,科里尔,科斯坦德,肯戈德,库扎克,昆迪纳格,拉纳瓦,兰赫拉,兰内尔格,里曾,里尔坎,林迪拉,林加斯,鲁尔基,鲁尔科克,马尔博德,马尔布兰德,马加尔德,迈尔迪斯,梅姆隆,米努,米斯托克,莫恩金,莫恩塔里克,莫尔鲁克,纳蒂尔,纳尔贡杜什,纳尔贡努尔,纳尔加巴尔,纳尔加萨尔布,纳古,纳拉格扎,纳拉蒙兹,纳拉扎尔,纳坦,内尔昆,内利兹,努尔巴拉姆,努尔比尔纳格,努尔克尔,努雷扎,努雷兹格,努卢卡兹,努卢库尔,诺尔吉尼,诺鲁克,欧尔德斯廷,欧兰,欧西,齐格兹,切尔贡,丘尔特克,萨德加奇,沙拉克扎尔,沙萨尔比兹,沙索拉,沙西兹杜什,舒拉克尊德,顺杜顺德,斯蒂赫雷,斯甘德罗尔,斯罗克万,苏尔杜奇,索尔福德,索卢克哈布,索罗特雷克,索姆鲁德,塔尔卡勒,图尔库格,图蒙扎尔,托尔凯格,托伦,托扎格,瓦尔德赫雷,瓦尔库德,威迪尔德,维尔菲尔斯,维尔赫拉,维尔韦德,维格坎,威莱亚,沃尔基格,沃齐格,乌蒙扎德,乌沙拉尔,西奥丹,西奥德格里姆,西德加,希尔德劳格,西格贝奥恩,西格比,希兹迪纳尔,伊德古尔斯,伊尔金,伊利,伊内兹,因吉尼,尤德戈尔,尤尔卡克,约尔莫斯,约尔南加尔,约拉,约塔内,祖格坎,祖格克"},


      {name: "Draconic", i: 39, min: 6, max: 14, d: "aliuszrox", m: 0,
        b: "阿达隆,阿达马隆多尔,阿尔杜因,阿尔恩加罗尔,阿尔哈泽尔,阿尔哈兹马巴德,阿尔塔戈斯,阿格哈兹塔姆恩,阿格拉拉罗丝,阿戈希尔沃尔,阿拉姆拉,阿劳高索斯,阿劳萨托尔,阿隆纳拉,阿玛拉萨,阿姆伦纳瑟德,阿纳格拉索斯,阿瑟格拉斯,阿维亚图拉斯,阿扎克,阿扎维兰德拉尔,埃尔德里西塞恩,艾格利尔,艾罗斯克卢格帕拉尔,艾斯豪普坦纳沙尼克斯,埃斯梅兰丹娜,安德拉萨纳克,安蒂尔洛托尔,奥达维因,奥尔马拉戈斯,奥格奥拉斯,奥洛松托尔,奥塔亚里亚卡诺斯,巴拉戈斯,巴拉塔斯拉尔,布拉兹波利斯,布留科伦德姆,查维卡纳索尔,达金图姆,丹戴默丹马拉尔,德拉根萨罗尔,德拉科诺巴伦,迪欧布普尔克温派尔,杜尔内维尔,杜普雷蒂斯卡瓦,多姆博尔科赫,法恩费莉,费尔戈洛斯,费尔里文瑟尔,菲克拉格,富尔利纳斯蒂斯,弗尔塔克,弗勒伊瑟塔特,弗隆达霍雷沃斯,高兰塔特拉,高劳恩提尔,格雷施鲁克,格卢罗斯,古亚诺萨兹,哈克拉沙拉,哈拉格拉斯加尔,哈拉加斯特,哈瓦兰,海林武瑞姆,赫尔提派尔,赫西普雷萨维尔,胡恩达尔,基塞斯卡夏安,基斯塔里安斯,基索恩拉西萨尔,加尔格伦托尔,加尔萨穆斯,加拉达罗斯,贾拉肯,贾兰瓦洛斯,加尼塔利萨尔,杰尔雷斯凯特,卡普诺利希尔,卡斯特兰德希利安,卡瓦拉诺斯,卡西迪卡尔,坎斯拉克西斯,克拉格诺瑟玛,克拉肖斯,克劳吉伊利亚玛塔,克劳斯,克雷斯顿,克里欧凡西克斯,克利萨尔伦德拉尔,克鲁齐克雷尔,克鲁斯塔拉诺斯,克罗苏尔哈,克萨基索瓦尔,克萨瓦拉希米乌斯,库尔德拉克,库拉洛索桑塔,奎琳德里塔尔,拉雷斯,拉利欧内特,拉马伦托兹,拉萨里劳格,拉斯古尔,拉托维诺默,劳格洛斯戈尔,劳莫萨达尔,利马尔克,林格里默拉索斯,林纳维克斯,罗劳利姆,马尔德雷迪奥尔,马尔德里索尔,马尔里,玛费尔诺塞伊凯德纳尔,马格瑞希尔,马哈特纳托里安,马加罗瓦兰坦兹,马拉加尔索尔,马拉赞,马莱克萨勒诺,马莱拉戈斯,梅加斯,梅拉赫,梅勒斯托雷克斯,梅利欧尔迪安尼克斯,米尔穆尔尼尔,米卡尔根西斯,米斯巴拉扎克,米斯蒂纳尔佩拉德纳克勒斯,米特埃奇,莫鲁哈泽尔,莫鲁伊梅,纳哈格利夫,纳克索尔利塔尔斯萨,纳拉瓦劳萨托瑞尔,纳斯拉鲁姆,内瓦拉里奇,宁穆赫,努尔武瑞姆,诺拉洛斯卡拉加辛特,帕尔苏纳克斯,佩拉斯,佩伦德拉拉尔,普拉克萨萨兰多斯,普莱洛里斯坦,普罗坦瑟,齐兰萨尔,奇明斯提尔,切尔纳达提拉尔,切尔维斯,琴森希瓦,瑞洛尼基夫,萨布拉夏尔,萨赫罗塔尔,萨霍克尼尔,萨拉加特,萨拉斯卡拉格拉姆,萨林达拉格洛托尔,萨姆德拉利里昂,萨瓦卡,赛卡,沙恩德雷尔,沙拉玛劳斯,沙玛加尔,沙亚纳克斯,斯卡尔索恩,斯库尔奇,斯梅尔加达斯,斯萨朗根,斯斯里斯特,苏瑟西拉西斯,索格洛里摩戈罗斯,索克拉斯提斯,塔拉科尔,塔玛兰德,坦特勒夫吉瑟斯,特纳拉克托尔,瓦斯提雷克,维尔库西默哈尔,维洛拉,维诺敏达尔,维因图鲁斯,文德拉斯丹马拉尔,沃尔拉索,沃拉加曼萨,沃斯拉鲁姆,乌尔纳利索尔加斯拉,乌尔图留尔,乌尔文,乌尔约特纳克,乌因内西瓦,希尔瓦利萨姆,西罗萨玛兰,耶梅雷,伊阿科席尔达兰杜斯,伊尔德里斯克林,伊尔萨拉格,伊尔维拉阿萨希利萨尔,伊利萨尔加斯里尔,伊卢斯拉,伊姆里斯,伊尼克斯翠克斯,伊欧尔门诺斯,伊维奈洛拉索斯,伊谢纳利尔,伊尤伦迪姆,因格洛卡斯蒂米兹利安,泽尔莱内斯特雷克斯,扎-吉库,扎兰德里斯,兹兹普佐拉,尊达埃拉兹伊林,佐尔马帕莱拉斯"},

      {name: "Arachnid", i: 40, min: 4, max: 10, d: "erlsk", m: 0,
        b: "阿科克瑟尔,阿林奎尔,阿什拉什,阿斯塔克,艾尔乌里亚,埃基克,埃卡斯,埃克萨,埃库什塔伊德,艾利卡斯,艾塞德,艾斯鲁布,艾斯塔瑟,艾扎基斯,昂奇克斯,查霍卡克,查里斯,查希利埃斯,哈克肖,霍克希,霍萨,基尔祖尔,基哈秋德,基卡,基祖特,卡夫德,卡夫鲁德,卡哈克西什,卡哈兹萨凯斯,卡海克萨尔,卡赫拉扎尔,卡赫利瓦,卡亨查凯斯,卡洪科斯,卡霍罗西,卡霍什,卡克拉维,卡克诺,卡兰奇克,卡利索,卡斯托尔,卡斯托尔,卡索尔,卡亚克托斯,卡伊什图尔,卡伊西赫,卡扎尔,卡兹鲁,凯尔拉瓦斯,凯佐赫,克拉尔尼特,克拉克希斯,克拉库,克拉斯特克斯,克拉希雷尔,克雷尔沙,克雷希什蒂,克里尔尼,克里卡,克利修斯,克里亚修斯,科鲁尔,克罗提埃卡斯,克谢克克,孔鲁德,拉尔希,拉尔兹,拉尔兹希亚克,拉哈基韦克斯,拉哈奇尔,拉哈奇什,拉哈提克斯,拉海尔里兹瑟,拉海尔谢尔,拉赫尔希尔,拉霍斯纳特布,拉克泽斯,拉斯诺斯,拉斯提希,拉沃肖,拉希克拉卡尔,拉希克瑟,拉希科斯,拉希奇斯,拉希斯,拉希斯内德,拉希维,拉希维德,拉希西兹塞,拉希亚维科特,莱斯提德,莱祖赫,兰奇斯,雷尔尼,雷尔塔奇斯,雷基德,雷卡德,勒坎奇斯,勒希利尔,勒希瓦斯,勒扎德,雷兹尔,雷佐克凯斯,里尔乌尔,利拉,利乔罗,利瑟瓦,里亚基斯内克斯,利亚拉克,利亚利塞德,林塔查尔,伦奇尔,罗尔库,洛克图,洛奇埃奇布,罗扎克里,纳库尔,内尔哈尔内斯,嫩奇莱德,尼尔哈卡,尼尔伊赫,尼特厄尔,尼祖斯,尼佐赫,诺里科,奇克斯希,奇什罗斯,奇亚祖,奇兹希,切尔努尔,切西布,切兹,丘克沙,丘拉什,热霍奇斯瑟,热克,热克塔,热希哈希尔,热希卡特,热希库尔,热希亚斯泰德,热希兹里,萨克舒,萨提耶尔,萨兹,赛克佐瑟,塞伊卡斯,赛伊利切,赛泽德,桑奇切德,森奇,什拉夫霍斯,什拉夫乌斯,什拉丘沃,什兰卡什,什兰科,什雷苏,什里安提斯,什里尔霍德,什罗瓦尔西尔,什罗兹希,斯拉丘西,斯齐尔希斯,斯泽克努尔,斯泽鲁德,斯泽萨德,斯泽希尔,斯泽希罗斯,斯扎卡,斯扎库瓦,斯扎苏,斯扎希,斯扎希洛斯,斯佐恩科尔,斯佐努克,索诺西,希克萨克斯,希克沙,希克谢尔,希克谢赫,希罗,希塔,希亚夫希什,西亚卡克,希耶西,希耶佐希,希伊祖克,希扎,辛奇查伊尔,耶尔哈克谢斯,耶尔瑞希,耶卡维希,耶克罗克,耶克苏,耶克佐克斯,耶奇尔,耶威德,耶维德,耶希克泰希,耶西耶,伊艾希德,伊卢克,伊斯尼尔,伊希弗尔,泽尔拉克,泽克欧,扎哈伦乔,扎哈萨奇尔,扎哈斯阿尔希什,扎哈维里特,扎哈兹尔拉克,扎卡萨,扎奇克萨,兹尔尼布,兹亚里希"},

      {name: "Serpents", i: 41, min: 5, max: 11, d: "slrk", m: 0,
        b: "阿尔克斯,阿吉蒂斯,阿吉哈,阿吉伊,阿贾凯斯,阿克萨斯,阿克西斯,阿伦,阿普吉格,阿特哈兹,阿图斯,阿兹拉斯,埃尔格克,埃尔扎扎什,埃吉特什,埃什朱克,埃斯里斯,安杰谢,奥尔特斯,奥尔希,奥卢鲁斯,波尔朱内克,甘贾斯,戈尔特什,格拉尔特内斯,格拉吉沙夫,格拉斯吉,格雷希纳斯,格罗尔贾尔,格罗尔泽什,格罗兹拉什,戈普杰格斯,古杰伊卡,哈尔吉,海吉赫兹,赫尔库什,霍尔加雷兹,基金图斯,基瑟雷,加尔西图夫,加普贾,卡尔阿伦,卡尔卡什,卡吉,卡杰斯,卡克拉萨尔,卡普吉,卡思拉斯,科夫,克拉卡谢尔,克拉克,克拉普杰兹,克拉什朱莱斯,克拉兹吉,克里里吉斯,克鲁辛,科普杰斯,克普朱沙,克萨格兹,克萨萨,科斯拉什,科斯尤斯,克苏尔泽苏,库尔扎内克,库纳莱斯,拉尔古什,拉尔卡什,拉尔图夫,拉根,拉杰阿瑟什,拉杰塔斯,拉雷吉什,拉斯,拉兹雷什,拉兹朱夫,兰杰斯,里尔赞,里吉拉什,里斯,里斯,里斯,里斯鲁兹,鲁尔里,鲁克鲁苏什,鲁萨,鲁特杰斯,罗尔吉斯,罗克苏鲁什,罗瑟兹,马尔基斯,马尔金,马尔卡什,马格,马吉塔克,马拉,马卢什,马普贾,马桑,马斯,梅特加雷什,门贾斯,米吉赫加克,米斯贾斯,明贾什,莫纳苏,莫斯,纳尔卡,纳尔特斯,纳吉哈斯,纳克,纳鲁莎,纳普吉夫,纳什,纳什杰克兹,纳塔夫,纳朱加什,尼贾斯,尼杰特西夫,尼什吉斯,努斯,诺尔克斯,帕尔卡,帕贾,帕斯,帕图亨,帕兹贾斯,佩普杰拉斯,皮尔卡纳尔,皮图克,普克,萨尔贾斯,萨尔特斯,萨基特什,萨兹朱扎什,塞吉汉,塞斯,塞兹金塔,瑟尔特什,瑟兹拉斯,沙贾斯,沙什贾,沙斯,沙斯,舒尔贾里,顺贾勒尔,斯卡尔克里兹,斯卡夫,斯卡拉,斯卡勒,斯卡伦塔斯,斯卡斯杰鲁克,斯科尔,斯克尔卡拉斯,斯科兹吉,斯库尔图尔,斯库夫,斯库卢,斯拉埃,斯拉尔塔哈祖尔,斯拉尔特哈尔,斯拉利,斯拉普杰斯,斯拉什,斯拉特杰斯,斯拉特拉尔,斯莱尔兹雷斯,斯兰吉,斯雷尔卡什,斯利拉,斯鲁斯,斯鲁斯图格夫,斯洛兹吉萨,苏斯提尔,孙,索尔格,索杰什,索勒,瓦尔古什,维夫,维克,维斯图,沃尔特哈,伍普杰尔,伍斯杰萨什,乌兹拉什,希吉特,希纳什,希耶克,希兹兰,谢特什,伊卢夫,伊普贾尔,伊萨辛,赞杰尔,扎吉蒂斯,扎里斯,扎瑟格斯,兹尔雷斯,兹索尔,祖尔贾斯"},

      // additional by Avengium:
      {name: "Levantine", i: 42, min: 4, max: 12, d: "ankprs", m: 0,
        b: "阿德拉梅特,阿德梅,阿尔科什,阿尔瓦德,阿加迪尔,阿科,阿克兹布,阿拉登,阿利马斯,阿利斯-乌波,阿米德,阿穆鲁,阿什克隆,阿塔尔,阿提克,阿泽卡,阿扎,埃迪亚尔,埃弗拉塔,埃拉,埃梅克,埃蒙,埃因加尼姆,安达里格,安蒙,安帕,安皮,奥菲尔,奥亚,奥亚特,巴别,巴尔贝克,巴特龙,贝尔谢巴,贝利图斯,贝洛特,贝特阿古斯,贝特安亚,贝特尔,贝特纳林,贝特诺哈德拉,贝特谢梅什,贝特扎林,比尔穆拉,比鲁塔,比坦,比特阿古西,比特扎马尼,伯利恒,伯特-霍隆,伯特乌埃尔,察布拉坦,察尔法特,茨安,达尔姆苏克,达梅塞克,多尔,菲内卡,菲尼克,菲尼库斯,格巴勒,格德拉,各各他,格利兹姆,格瑟玛尼,歌珊,哈尔哈拜伊特,哈尔内沃,哈尔佩,哈尔皮斯加,哈加利勒,哈克尔德玛,哈拉卜,哈利邦,哈马特,哈琐,哈维拉,海法,霍尔马,基比翁,吉甲,基里亚特,基列,吉特,基提姆,加德斯,加低斯,加拉提亚,迦南,加沙,卡尔特-哈达什特,卡尔特-图巴撒雷普塔,卡拉利,卡帕拉,卡特纳,凯雷特哈德谢特,凯萨里亚,克尔纳,刻尔奈,克法尔,克法尔纳胡姆,科塞德,库尔达,拉巴特阿蒙,拉尔纳,拉卡特,拉马特阿维夫,拉米萨,拉姆塔,拉佩托斯,莱普基斯,莱普里普扎,雷霍沃特,雷谢夫,利克索斯,卢夫,鲁沙迪尔,鲁沙卡德,罗德,马拉卡,马拉特,马莱特,梅察达,梅尔丁,梅利塔,米吉多,米什马罗特,米兹拉因,莫蒂耶,摩普索斯,摩押,穆基什,纳茨拉特,南皮古,南皮吉,尼尼微,宁路德,努哈德拉,挪伯,普莱谢特,齐克隆,萨姆林,塞克西,塞帕特,色法拉德,色希雍,沙仑,什法尼姆,什玛亚,示剑,示罗,苏尔,苏里亚,索尔基,塔贝图,塔德穆尔,塔尔图斯,他施,特贝里亚,特菲塞德特,特伊曼,提哥亚,提帕萨,廷加,图尔阿卜丁,瓦加,乌尔海,乌加里特,乌雷什勒姆,乌鲁沙利姆,乌努巴尔,希伯伦,西顿,西奈,西斯,肖姆隆,谢菲拉特,雅法,亚夫内,亚兰,亚姆哈德,亚姆哈梅拉赫,亚姆基内莱特,亚穆特巴尔,亚特里卜,亚乌迪,耶夫,耶胡达,耶路沙莱姆,耶乌斯,伊博希姆,伊登埃克伦,伊里杜,伊里霍,伊里内姆,以色列,依兹里尔,尤尔德南,泽博伊姆,泽乌尔塔,泽伊廷,扎列法特,兹穆尔纳,佐尔"}
    ];
  };

  return {
    getBase,
    getCulture,
    getCultureShort,
    getBaseShort,
    getState,
    updateChain,
    clearChains,
    getNameBases,
    getMapName,
    calculateChain
  };
})();
